dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h

/* ########################################################################## */
/*
 * This file was created by www.DavesMotleyProjects.com
 *
 * This software is provided under the following conditions:
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files (the
 * 'Software'), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to
 * permit persons to whom the Software is furnished to do so, subject to
 * the following conditions:
 *
 * THE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
 * CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
 * TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
 * SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *                                                                            */
/* ########################################################################## */


/* ===========================================================================*/
/*
 * FileName:      MSP430F5529LP.h
 *
 * This file provides the standard register and bit definitions for the
 * Texas Instruments MSP430F5529 Launchpad development board.
 *
 * Version 1.0
 *
 * Rev. 1.0, Initial Release
 * Rev. 1.1, Updates to the PMM Power Management System definitions to provide
 * additional byte level and bit-select access.
 *
 *                                                                            */
/* ===========================================================================*/

#ifndef __MSP430F5529LP__
#define __MSP430F5529LP__


#ifdef __cplusplus
    #define __READ    /* not supported */
#else
    #define __READ    const
#endif

#ifdef __cplusplus
    extern "C" {
#endif


#include <in430.h>
#include <iomacros.h>


#ifndef NULL
    #define NULL 0
#endif


/************************************************************
* DEFINE STANDARD TYPES
************************************************************/

// Define machine dependant types
typedef unsigned char         uint8_t;
typedef signed char           int8_t;
typedef unsigned short        uint16_t;
typedef signed short          int16_t;
typedef unsigned long         uint32_t;
typedef signed long           int32_t;


/************************************************************
* STANDARD BITS
************************************************************/

#define BIT0                (0x0001)
#define BIT1                (0x0002)
#define BIT2                (0x0004)
#define BIT3                (0x0008)
#define BIT4                (0x0010)
#define BIT5                (0x0020)
#define BIT6                (0x0040)
#define BIT7                (0x0080)
#define BIT8                (0x0100)
#define BIT9                (0x0200)
#define BITA                (0x0400)
#define BITB                (0x0800)
#define BITC                (0x1000)
#define BITD                (0x2000)
#define BITE                (0x4000)
#define BITF                (0x8000)


/************************************************************
* STATUS REGISTER BITS
************************************************************/

#define C                   (0x0001)
#define Z                   (0x0002)
#define N                   (0x0004)
#define V                   (0x0100)
#define GIE                 (0x0008)
#define CPUOFF              (0x0010)
#define OSCOFF              (0x0020)
#define SCG0                (0x0040)
#define SCG1                (0x0080)

/* Low Power Modes coded with Bits 4-7 in SR */

#define LPM0_bits           (CPUOFF)
#define LPM1_bits           (SCG0+CPUOFF)
#define LPM2_bits           (SCG1+CPUOFF)
#define LPM3_bits           (SCG1+SCG0+CPUOFF)
#define LPM4_bits           (SCG1+SCG0+OSCOFF+CPUOFF)


#define LPM0      __bis_SR_register(LPM0_bits)          /* Enter LPM0 */
#define LPM0_EXIT __bic_SR_register_on_exit(LPM0_bits)  /* Exit LPM0 */
#define LPM1      __bis_SR_register(LPM1_bits)          /* Enter LPM1 */
#define LPM1_EXIT __bic_SR_register_on_exit(LPM1_bits)  /* Exit LPM1 */
#define LPM2      __bis_SR_register(LPM2_bits)          /* Enter LPM2 */
#define LPM2_EXIT __bic_SR_register_on_exit(LPM2_bits)  /* Exit LPM2 */
#define LPM3      __bis_SR_register(LPM3_bits)          /* Enter LPM3 */
#define LPM3_EXIT __bic_SR_register_on_exit(LPM3_bits)  /* Exit LPM3 */
#define LPM4      __bis_SR_register(LPM4_bits)          /* Enter LPM4 */
#define LPM4_EXIT __bic_SR_register_on_exit(LPM4_bits)  /* Exit LPM4 */







/*#########################################################################
 *   ADC12
*##########################################################################*/


typedef volatile union
{
    uint16_t reg;             /* ADC12+ Control 0 */
    struct
    {
        uint16_t ADC12SC              : 1; /* ADC12 Start Conversion */
        uint16_t ADC12ENC             : 1; /* ADC12 Enable Conversion */
        uint16_t ADC12TOVIE           : 1; /* ADC12 Timer Overflow interrupt enable */
        uint16_t ADC12OVIE            : 1; /* ADC12 Overflow interrupt enable */
        uint16_t ADC12ON              : 1; /* ADC12 On/enable */
        uint16_t ADC12REFON           : 1; /* ADC12 Reference on */
        uint16_t ADC12REF2_5V         : 1; /*  */
        uint16_t ADC12MSC             : 1; /* ADC12 Multiple SampleConversion */
        uint16_t ADC12SHT0x           : 4; /* ADC12 Sample Hold 0 Select Bits */
        uint16_t ADC12SHT1x           : 4; /* ADC12 Sample Hold 1 Select Bits */
    } bits;
} ADC12CTL0_t;

#define p_ADC12CTL0                 ((ADC12CTL0_t        *) 0x0700u)
#define ADC12CTL0                   p_ADC12CTL0->reg
#define ADC12CTL0_bits              p_ADC12CTL0->bits


