dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
typedef volatile union
{
    uint16_t reg;           /* ADC12+ Control 1 */
    struct
    {
        uint16_t ADC12BUSY            : 1; /* ADC12 Busy */
        uint16_t ADC12CONSEQx         : 2; /* ADC12 Conversion Sequence Select Bits */
        uint16_t ADC12SSELx           : 2; /* ADC12 Clock Source Select Bits */
        uint16_t ADC12DIVx            : 3; /* ADC12 Clock Divider Select Bits */
        uint16_t ADC12ISSH            : 1; /* ADC12 Invert Sample Hold Signal */
        uint16_t ADC12SHP             : 1; /* ADC12 Sample/Hold Pulse Mode */
        uint16_t ADC12SHSx            : 2; /* ADC12 Sample/Hold Source Bits */
        uint16_t ADC12CSTARTADDx      : 4; /* ADC12 Conversion Start Address Bits */
    } bits;
} ADC12CTL1_t;

#define p_ADC12CTL1                 ((ADC12CTL1_t        *) 0x0702u)
#define ADC12CTL1                   p_ADC12CTL1->reg
#define ADC12CTL1_bits              p_ADC12CTL1->bits


typedef volatile union
{
    uint16_t reg;           /* ADC12+ Control 2 */
    struct
    {
        uint16_t ADC12REFBURST        : 1; /* ADC12+ Reference Burst */
        uint16_t ADC12REFOUT          : 1; /* ADC12+ Reference Out */
        uint16_t ADC12SR              : 1; /* ADC12+ Sampling Rate */
        uint16_t ADC12DF              : 1; /* ADC12+ Data Format */
        uint16_t ADC12RESx            : 2; /* ADC12+ Resolution Bits */
        uint16_t                      : 1;
        uint16_t ADC12TCOFF           : 1; /* ADC12+ Temperature Sensor Off */
        uint16_t ADC12PDIV            : 1; /* ADC12+ predivider 0:/1   1:/4 */
    } bits;
} ADC12CTL2_t;

#define p_ADC12CTL2                 ((ADC12CTL2_t        *) 0x0704u)
#define ADC12CTL2                   p_ADC12CTL2->reg
#define ADC12CTL2_bits              p_ADC12CTL2->bits


typedef volatile union
{
    uint16_t reg;           /* ADC12+ Interrupt Flag */
    struct
    {
        uint16_t ADC12IFG0            : 1; /* ADC12 Memory 0 Interrupt Flag */
        uint16_t ADC12IFG1            : 1; /* ADC12 Memory 1 Interrupt Flag */
        uint16_t ADC12IFG2            : 1; /* ADC12 Memory 2 Interrupt Flag */
        uint16_t ADC12IFG3            : 1; /* ADC12 Memory 3 Interrupt Flag */
        uint16_t ADC12IFG4            : 1; /* ADC12 Memory 4 Interrupt Flag */
        uint16_t ADC12IFG5            : 1; /* ADC12 Memory 5 Interrupt Flag */
        uint16_t ADC12IFG6            : 1; /* ADC12 Memory 6 Interrupt Flag */
        uint16_t ADC12IFG7            : 1; /* ADC12 Memory 7 Interrupt Flag */
        uint16_t ADC12IFG8            : 1; /* ADC12 Memory 8 Interrupt Flag */
        uint16_t ADC12IFG9            : 1; /* ADC12 Memory 9 Interrupt Flag */
        uint16_t ADC12IFG10           : 1; /* ADC12 Memory 10 Interrupt Flag */
        uint16_t ADC12IFG11           : 1; /* ADC12 Memory 11 Interrupt Flag */
        uint16_t ADC12IFG12           : 1; /* ADC12 Memory 12 Interrupt Flag */
        uint16_t ADC12IFG13           : 1; /* ADC12 Memory 13 Interrupt Flag */
        uint16_t ADC12IFG14           : 1; /* ADC12 Memory 14 Interrupt Flag */
        uint16_t ADC12IFG15           : 1; /* ADC12 Memory 15 Interrupt Flag */
    } bits;
} ADC12IFG_t;

#define p_ADC12IFG                  ((ADC12IFG_t        *) 0x070Au)
#define ADC12IFG                    p_ADC12IFG->reg
#define ADC12IFG_bits               p_ADC12IFG->bits


typedef volatile union
{
    uint16_t reg;         /* ADC12+ Interrupt Enable */
    struct
    {
        uint16_t ADC12IE0             : 1; /* ADC12 Memory 0 Interrupt Enable */
        uint16_t ADC12IE1             : 1; /* ADC12 Memory 1 Interrupt Enable */
        uint16_t ADC12IE2             : 1; /* ADC12 Memory 2 Interrupt Enable */
        uint16_t ADC12IE3             : 1; /* ADC12 Memory 3 Interrupt Enable */
        uint16_t ADC12IE4             : 1; /* ADC12 Memory 4 Interrupt Enable */
        uint16_t ADC12IE5             : 1; /* ADC12 Memory 5 Interrupt Enable */
        uint16_t ADC12IE6             : 1; /* ADC12 Memory 6 Interrupt Enable */
        uint16_t ADC12IE7             : 1; /* ADC12 Memory 7 Interrupt Enable */
        uint16_t ADC12IE8             : 1; /* ADC12 Memory 8 Interrupt Enable */
        uint16_t ADC12IE9             : 1; /* ADC12 Memory 9 Interrupt Enable */
        uint16_t ADC12IE10            : 1; /* ADC12 Memory 10 Interrupt Enable */
        uint16_t ADC12IE11            : 1; /* ADC12 Memory 11 Interrupt Enable */
        uint16_t ADC12IE12            : 1; /* ADC12 Memory 12 Interrupt Enable */
        uint16_t ADC12IE13            : 1; /* ADC12 Memory 13 Interrupt Enable */
        uint16_t ADC12IE14            : 1; /* ADC12 Memory 14 Interrupt Enable */
        uint16_t ADC12IE15            : 1; /* ADC12 Memory 15 Interrupt Enable */
    } bits;
} ADC12IE_t;

#define p_ADC12IE                   ((ADC12IE_t        *) 0x070Cu)
#define ADC12IE                     p_ADC12IE->reg
#define ADC12IE_bits                p_ADC12IE->bits


/* ADC12+ Interrupt Vector Word */
typedef volatile uint16_t ADC12IV_t;
#define p_ADC12IV               ((ADC12IV_t     *) 0x070Eu)
#define ADC12IV                 *p_ADC12IV


/* ADC12 Conversion Memory */
typedef volatile uint16_t ADC12MEMx_t;

#define p_ADC12MEM0               ((ADC12MEMx_t     *) 0x0720u)
#define ADC12MEM0                 *p_ADC12MEM0

#define p_ADC12MEM1               ((ADC12MEMx_t     *) 0x0722u)
#define ADC12MEM1                 *p_ADC12MEM1

#define p_ADC12MEM2               ((ADC12MEMx_t     *) 0x0724u)
#define ADC12MEM2                 *p_ADC12MEM2

#define p_ADC12MEM3               ((ADC12MEMx_t     *) 0x0726u)
#define ADC12MEM3                 *p_ADC12MEM3

#define p_ADC12MEM4               ((ADC12MEMx_t     *) 0x0728u)
#define ADC12MEM4                 *p_ADC12MEM4

#define p_ADC12MEM5               ((ADC12MEMx_t     *) 0x072Au)
#define ADC12MEM5                 *p_ADC12MEM5

#define p_ADC12MEM6               ((ADC12MEMx_t     *) 0x072Cu)
#define ADC12MEM6                 *p_ADC12MEM6

#define p_ADC12MEM7               ((ADC12MEMx_t     *) 0x072Eu)
#define ADC12MEM7                 *p_ADC12MEM7

