dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
#define p_ADC12MEM8               ((ADC12MEMx_t     *) 0x0730u)
#define ADC12MEM8                 *p_ADC12MEM8

#define p_ADC12MEM9               ((ADC12MEMx_t     *) 0x0732u)
#define ADC12MEM9                 *p_ADC12MEM9

#define p_ADC12MEM10              ((ADC12MEMx_t     *) 0x0734u)
#define ADC12MEM10                *p_ADC12MEM10

#define p_ADC12MEM11              ((ADC12MEMx_t     *) 0x0736u)
#define ADC12MEM11                *p_ADC12MEM11

#define p_ADC12MEM12              ((ADC12MEMx_t     *) 0x0738u)
#define ADC12MEM12                *p_ADC12MEM12

#define p_ADC12MEM13              ((ADC12MEMx_t     *) 0x073Au)
#define ADC12MEM13                *p_ADC12MEM13

#define p_ADC12MEM14              ((ADC12MEMx_t     *) 0x073Cu)
#define ADC12MEM14                *p_ADC12MEM14

#define p_ADC12MEM15              ((ADC12MEMx_t     *) 0x073Eu)
#define ADC12MEM15                *p_ADC12MEM15


typedef volatile union
{
    uint8_t reg;   /* ADC12 Memory Control x */
    struct
    {
        uint8_t ADC12INCHx            : 4; /* ADC12 Input Channel Select Bits */
        uint8_t ADC12SREFx            : 3; /* ADC12 Select Reference Bits */
        uint8_t ADC12EOS              : 1; /* ADC12 End of Sequence */
    }bits;
} ADC12MCTLx_t;

#define p_ADC12MCTL0                ((ADC12MCTLx_t        *) 0x0710u)
#define ADC12MCTL0                  p_ADC12MCTL0->reg
#define ADC12MCTL0_bits             p_ADC12MCTL0->bits

#define p_ADC12MCTL1                ((ADC12MCTLx_t        *) 0x0711u)
#define ADC12MCTL1                  p_ADC12MCTL1->reg
#define ADC12MCTL1_bits             p_ADC12MCTL1->bits

#define p_ADC12MCTL2                ((ADC12MCTLx_t        *) 0x0712u)
#define ADC12MCTL2                  p_ADC12MCTL2->reg
#define ADC12MCTL2_bits             p_ADC12MCTL2->bits

#define p_ADC12MCTL3                ((ADC12MCTLx_t        *) 0x0713u)
#define ADC12MCTL3                  p_ADC12MCTL3->reg
#define ADC12MCTL3_bits             p_ADC12MCTL3->bits

#define p_ADC12MCTL4                ((ADC12MCTLx_t        *) 0x0714u)
#define ADC12MCTL4                  p_ADC12MCTL4->reg
#define ADC12MCTL4_bits             p_ADC12MCTL4->bits

#define p_ADC12MCTL5                ((ADC12MCTLx_t        *) 0x0715u)
#define ADC12MCTL5                  p_ADC12MCTL5->reg
#define ADC12MCTL5_bits             p_ADC12MCTL5->bits

#define p_ADC12MCTL6                ((ADC12MCTLx_t        *) 0x0716u)
#define ADC12MCTL6                  p_ADC12MCTL6->reg
#define ADC12MCTL6_bits             p_ADC12MCTL6->bits

#define p_ADC12MCTL7                ((ADC12MCTLx_t        *) 0x0717u)
#define ADC12MCTL7                  p_ADC12MCTL7->reg
#define ADC12MCTL7_bits             p_ADC12MCTL7->bits

#define p_ADC12MCTL8                ((ADC12MCTLx_t        *) 0x0718u)
#define ADC12MCTL8                  p_ADC12MCTL8->reg
#define ADC12MCTL8_bits             p_ADC12MCTL8->bits

#define p_ADC12MCTL9                ((ADC12MCTLx_t        *) 0x0719u)
#define ADC12MCTL9                  p_ADC12MCTL9->reg
#define ADC12MCTL9_bits             p_ADC12MCTL9->bits

#define p_ADC12MCTL10               ((ADC12MCTLx_t        *) 0x071Au)
#define ADC12MCTL10                 p_ADC12MCTL10->reg
#define ADC12MCTL10_bits            p_ADC12MCTL10->bits

#define p_ADC12MCTL11               ((ADC12MCTLx_t        *) 0x071Bu)
#define ADC12MCTL11                 p_ADC12MCTL11->reg
#define ADC12MCTL11_bits            p_ADC12MCTL11->bits

#define p_ADC12MCTL12               ((ADC12MCTLx_t        *) 0x071Cu)
#define ADC12MCTL12                 p_ADC12MCTL12->reg
#define ADC12MCTL12_bits            p_ADC12MCTL12->bits

#define p_ADC12MCTL13               ((ADC12MCTLx_t        *) 0x071Du)
#define ADC12MCTL13                 p_ADC12MCTL13->reg
#define ADC12MCTL13_bits            p_ADC12MCTL13->bits

#define p_ADC12MCTL14               ((ADC12MCTLx_t        *) 0x071Eu)
#define ADC12MCTL14                 p_ADC12MCTL14->reg
#define ADC12MCTL14_bits            p_ADC12MCTL14->bits

#define p_ADC12MCTL15               ((ADC12MCTLx_t        *) 0x071Fu)
#define ADC12MCTL15                 p_ADC12MCTL15->reg
#define ADC12MCTL15_bits            p_ADC12MCTL15->bits


/*   ADC12 Interrupt Vector Sources   */
#define ADC12IV_NONE                0x00u
#define ADC12IV_ADC12MEMx_OVFL      0x02u
#define ADC12IV_ADC12CONV_OVFL      0x04u
#define ADC12IV_ADC12MEM0_IFG       0x06u
#define ADC12IV_ADC12MEM1_IFG       0x08u
#define ADC12IV_ADC12MEM2_IFG       0x0Au
#define ADC12IV_ADC12MEM3_IFG       0x0Cu
#define ADC12IV_ADC12MEM4_IFG       0x0Eu
#define ADC12IV_ADC12MEM5_IFG       0x10u
#define ADC12IV_ADC12MEM6_IFG       0x12u
#define ADC12IV_ADC12MEM7_IFG       0x14u
#define ADC12IV_ADC12MEM8_IFG       0x16u
#define ADC12IV_ADC12MEM9_IFG       0x18u
#define ADC12IV_ADC12MEM10_IFG      0x1Au
#define ADC12IV_ADC12MEM11_IFG      0x1Cu
#define ADC12IV_ADC12MEM12_IFG      0x1Eu
#define ADC12IV_ADC12MEM13_IFG      0x20u
#define ADC12IV_ADC12MEM14_IFG      0x22u
#define ADC12IV_ADC12MEM15_IFG      0x24u





/*#########################################################################
 *   Comparator B
*##########################################################################*/

    // Not supported yet



/*#########################################################################
 *   CRC16
*##########################################################################*/

    // Not supported yet



/*#########################################################################
 *   DMA
*##########################################################################*/

// Not supported yet



/*#########################################################################
 *   Flash
*##########################################################################*/

// Not supported yet



/*#########################################################################
 *   MPY 16  Multiplier  16 Bit Mode
*##########################################################################*/

// Not supported yet



/*#########################################################################
 *   MPY 32  Multiplier  32 Bit Mode
*##########################################################################*/

// Not supported yet



/*#############################################################################
 *   Port A (16-bit access), Ports 1 & 2 (8-bit access)
*############################################################################*/


