dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
/*%%%%% INPUT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 1 Input */
    struct
    {
        unsigned __READ char P1IN0           : 1; /*  */
        unsigned __READ char P1IN1           : 1; /*  */
        unsigned __READ char P1IN2           : 1; /*  */
        unsigned __READ char P1IN3           : 1; /*  */
        unsigned __READ char P1IN4           : 1; /*  */
        unsigned __READ char P1IN5           : 1; /*  */
        unsigned __READ char P1IN6           : 1; /*  */
        unsigned __READ char P1IN7           : 1; /*  */
    } bits;
} P1IN_t;

#define p_P1IN                  ((P1IN_t        *) 0x0200u)
#define P1IN                    p_P1IN->reg
#define P1IN_bits               p_P1IN->bits


typedef volatile union
{
    uint8_t reg;            /* Port 2 Input */
    struct
    {
        unsigned __READ char P2IN0           : 1; /*  */
        unsigned __READ char P2IN1           : 1; /*  */
        unsigned __READ char P2IN2           : 1; /*  */
        unsigned __READ char P2IN3           : 1; /*  */
        unsigned __READ char P2IN4           : 1; /*  */
        unsigned __READ char P2IN5           : 1; /*  */
        unsigned __READ char P2IN6           : 1; /*  */
        unsigned __READ char P2IN7           : 1; /*  */
    } bits;
} P2IN_t;

#define p_P2IN                  ((P2IN_t        *) 0x0201u)
#define P2IN                    p_P2IN->reg
#define P2IN_bits               p_P2IN->bits


typedef volatile union
{
    uint16_t reg;        /* Port A Input */
    struct
    {
        unsigned __READ short PAIN0           : 1; /*  */
        unsigned __READ short PAIN1           : 1; /*  */
        unsigned __READ short PAIN2           : 1; /*  */
        unsigned __READ short PAIN3           : 1; /*  */
        unsigned __READ short PAIN4           : 1; /*  */
        unsigned __READ short PAIN5           : 1; /*  */
        unsigned __READ short PAIN6           : 1; /*  */
        unsigned __READ short PAIN7           : 1; /*  */
        unsigned __READ short PAIN8           : 1; /*  */
        unsigned __READ short PAIN9           : 1; /*  */
        unsigned __READ short PAIN10          : 1; /*  */
        unsigned __READ short PAIN11          : 1; /*  */
        unsigned __READ short PAIN12          : 1; /*  */
        unsigned __READ short PAIN13          : 1; /*  */
        unsigned __READ short PAIN14          : 1; /*  */
        unsigned __READ short PAIN15          : 1; /*  */
    } bits;
} PAIN_t;

#define p_PAIN                  ((PAIN_t        *) 0x0200u)
#define PAIN                    p_PAIN->reg
#define PAIN_bits               p_PAIN->bits


/*%%%%% OUTPUT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 1 Output */
    struct
    {
        uint8_t P1OUT0           : 1; /*  */
        uint8_t P1OUT1           : 1; /*  */
        uint8_t P1OUT2           : 1; /*  */
        uint8_t P1OUT3           : 1; /*  */
        uint8_t P1OUT4           : 1; /*  */
        uint8_t P1OUT5           : 1; /*  */
        uint8_t P1OUT6           : 1; /*  */
        uint8_t P1OUT7           : 1; /*  */
    } bits;
} P1OUT_t;

#define p_P1OUT                 ((P1OUT_t       *) 0x0202u)
#define P1OUT                   p_P1OUT->reg
#define P1OUT_bits              p_P1OUT->bits


typedef volatile union
{
    uint8_t reg;            /* Port 2 Output */
    struct
    {
        uint8_t P2OUT0           : 1; /*  */
        uint8_t P2OUT1           : 1; /*  */
        uint8_t P2OUT2           : 1; /*  */
        uint8_t P2OUT3           : 1; /*  */
        uint8_t P2OUT4           : 1; /*  */
        uint8_t P2OUT5           : 1; /*  */
        uint8_t P2OUT6           : 1; /*  */
        uint8_t P2OUT7           : 1; /*  */
    } bits;
} P2OUT_t;

#define p_P2OUT                 ((P2OUT_t       *) 0x0203u)
#define P2OUT                   p_P2OUT->reg
#define P2OUT_bits              p_P2OUT->bits


typedef volatile union
{
    uint16_t reg;        /* Port A Output */
    struct
    {
        uint16_t PAOUT0           : 1; /*  */
        uint16_t PAOUT1           : 1; /*  */
        uint16_t PAOUT2           : 1; /*  */
        uint16_t PAOUT3           : 1; /*  */
        uint16_t PAOUT4           : 1; /*  */
        uint16_t PAOUT5           : 1; /*  */
        uint16_t PAOUT6           : 1; /*  */
        uint16_t PAOUT7           : 1; /*  */
        uint16_t PAOUT8           : 1; /*  */
        uint16_t PAOUT9           : 1; /*  */
        uint16_t PAOUT10          : 1; /*  */
        uint16_t PAOUT11          : 1; /*  */
        uint16_t PAOUT12          : 1; /*  */
        uint16_t PAOUT13          : 1; /*  */
        uint16_t PAOUT14          : 1; /*  */
        uint16_t PAOUT15          : 1; /*  */
    } bits;
} PAOUT_t;

#define p_PAOUT                 ((PAOUT_t       *) 0x0202u)
#define PAOUT                   p_PAOUT->reg
#define PAOUT_bits              p_PAOUT->bits


/*%%%%% DIRECTION %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 1 Direction */
    struct
    {
        uint8_t P1DIR0          : 1; /*  */
        uint8_t P1DIR1          : 1; /*  */
        uint8_t P1DIR2          : 1; /*  */
        uint8_t P1DIR3          : 1; /*  */
        uint8_t P1DIR4          : 1; /*  */
        uint8_t P1DIR5          : 1; /*  */
        uint8_t P1DIR6          : 1; /*  */
        uint8_t P1DIR7          : 1; /*  */
    } bits;
} P1DIR_t;

#define p_P1DIR                 ((P1DIR_t       *) 0x0204u)
#define P1DIR                   p_P1DIR->reg
#define P1DIR_bits              p_P1DIR->bits


typedef volatile union
{
    uint8_t reg;            /* Port 2 Direction */
    struct
    {
        uint8_t P2DIR0          : 1; /*  */
        uint8_t P2DIR1          : 1; /*  */
        uint8_t P2DIR2          : 1; /*  */
        uint8_t P2DIR3          : 1; /*  */
        uint8_t P2DIR4          : 1; /*  */
        uint8_t P2DIR5          : 1; /*  */
        uint8_t P2DIR6          : 1; /*  */
        uint8_t P2DIR7          : 1; /*  */
    } bits;
} P2DIR_t;

