dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
#define p_P2DIR                 ((P2DIR_t       *) 0x0205u)
#define P2DIR                   p_P2DIR->reg
#define P2DIR_bits              p_P2DIR->bits


typedef volatile union
{
    uint16_t reg;        /* Port A Direction */
    struct
    {
        uint16_t PADIR0          : 1; /*  */
        uint16_t PADIR1          : 1; /*  */
        uint16_t PADIR2          : 1; /*  */
        uint16_t PADIR3          : 1; /*  */
        uint16_t PADIR4          : 1; /*  */
        uint16_t PADIR5          : 1; /*  */
        uint16_t PADIR6          : 1; /*  */
        uint16_t PADIR7          : 1; /*  */
        uint16_t PADIR8          : 1; /*  */
        uint16_t PADIR9          : 1; /*  */
        uint16_t PADIR10         : 1; /*  */
        uint16_t PADIR11         : 1; /*  */
        uint16_t PADIR12         : 1; /*  */
        uint16_t PADIR13         : 1; /*  */
        uint16_t PADIR14         : 1; /*  */
        uint16_t PADIR15         : 1; /*  */
    } bits;
} PADIR_t;

#define p_PADIR                 ((PADIR_t       *) 0x0204u)
#define PADIR                   p_PADIR->reg
#define PADIR_bits              p_PADIR->bits


/*%%%%% RESISTOR ENABLE %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 1 Resistor Enable */
    struct
    {
        uint8_t P1REN0          : 1; /*  */
        uint8_t P1REN1          : 1; /*  */
        uint8_t P1REN2          : 1; /*  */
        uint8_t P1REN3          : 1; /*  */
        uint8_t P1REN4          : 1; /*  */
        uint8_t P1REN5          : 1; /*  */
        uint8_t P1REN6          : 1; /*  */
        uint8_t P1REN7          : 1; /*  */
    } bits;
} P1REN_t;

#define p_P1REN                 ((P1REN_t       *) 0x0206u)
#define P1REN                   p_P1REN->reg
#define P1REN_bits              p_P1REN->bits


typedef volatile union
{
    uint8_t reg;            /* Port 2 Resistor Enable */
    struct
    {
        uint8_t P2REN0          : 1; /*  */
        uint8_t P2REN1          : 1; /*  */
        uint8_t P2REN2          : 1; /*  */
        uint8_t P2REN3          : 1; /*  */
        uint8_t P2REN4          : 1; /*  */
        uint8_t P2REN5          : 1; /*  */
        uint8_t P2REN6          : 1; /*  */
        uint8_t P2REN7          : 1; /*  */
    } bits;
} P2REN_t;

#define p_P2REN                 ((P2REN_t       *) 0x0207u)
#define P2REN                   p_P2REN->reg
#define P2REN_bits              p_P2REN->bits


typedef volatile union
{
    uint16_t reg;        /* Port A Resistor Enable */
    struct
    {
        uint16_t PAREN0          : 1; /*  */
        uint16_t PAREN1          : 1; /*  */
        uint16_t PAREN2          : 1; /*  */
        uint16_t PAREN3          : 1; /*  */
        uint16_t PAREN4          : 1; /*  */
        uint16_t PAREN5          : 1; /*  */
        uint16_t PAREN6          : 1; /*  */
        uint16_t PAREN7          : 1; /*  */
        uint16_t PAREN8          : 1; /*  */
        uint16_t PAREN9          : 1; /*  */
        uint16_t PAREN10         : 1; /*  */
        uint16_t PAREN11         : 1; /*  */
        uint16_t PAREN12         : 1; /*  */
        uint16_t PAREN13         : 1; /*  */
        uint16_t PAREN14         : 1; /*  */
        uint16_t PAREN15         : 1; /*  */
    } bits;
} PAREN_t;

#define p_PAREN                 ((PAREN_t       *) 0x0206u)
#define PAREN                   p_PAREN->reg
#define PAREN_bits              p_PAREN->bits


/*%%%%% DRIVE STRENGTH %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 1 Drive Strength */
    struct
    {
        uint8_t P1DS0          : 1; /*  */
        uint8_t P1DS1          : 1; /*  */
        uint8_t P1DS2          : 1; /*  */
        uint8_t P1DS3          : 1; /*  */
        uint8_t P1DS4          : 1; /*  */
        uint8_t P1DS5          : 1; /*  */
        uint8_t P1DS6          : 1; /*  */
        uint8_t P1DS7          : 1; /*  */
    } bits;
} P1DS_t;

#define p_P1DS                  ((P1DS_t        *) 0x0208u)
#define P1DS                    p_P1DS->reg
#define P1DS_bits               p_P1DS->bits


typedef volatile union
{
    uint8_t reg;            /* Port 2 Drive Strength */
    struct
    {
        uint8_t P2DS0          : 1; /*  */
        uint8_t P2DS1          : 1; /*  */
        uint8_t P2DS2          : 1; /*  */
        uint8_t P2DS3          : 1; /*  */
        uint8_t P2DS4          : 1; /*  */
        uint8_t P2DS5          : 1; /*  */
        uint8_t P2DS6          : 1; /*  */
        uint8_t P2DS7          : 1; /*  */
    } bits;
} P2DS_t;

#define p_P2DS                  ((P2DS_t        *) 0x0209u)
#define P2DS                    p_P2DS->reg
#define P2DS_bits               p_P2DS->bits


typedef volatile union
{
    uint16_t reg;        /* Port A Drive Strength */
    struct
    {
        uint16_t PADS0          : 1; /*  */
        uint16_t PADS1          : 1; /*  */
        uint16_t PADS2          : 1; /*  */
        uint16_t PADS3          : 1; /*  */
        uint16_t PADS4          : 1; /*  */
        uint16_t PADS5          : 1; /*  */
        uint16_t PADS6          : 1; /*  */
        uint16_t PADS7          : 1; /*  */
        uint16_t PADS8          : 1; /*  */
        uint16_t PADS9          : 1; /*  */
        uint16_t PADS10         : 1; /*  */
        uint16_t PADS11         : 1; /*  */
        uint16_t PADS12         : 1; /*  */
        uint16_t PADS13         : 1; /*  */
        uint16_t PADS14         : 1; /*  */
        uint16_t PADS15         : 1; /*  */
    } bits;
} PADS_t;

#define p_PADS                  ((PADS_t        *) 0x0208u)
#define PADS                    p_PADS->reg
#define PADS_bits               p_PADS->bits


/*%%%%% SELECT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 1 Select */
    struct
    {
        uint8_t P1SEL0          : 1; /*  */
        uint8_t P1SEL1          : 1; /*  */
        uint8_t P1SEL2          : 1; /*  */
        uint8_t P1SEL3          : 1; /*  */
        uint8_t P1SEL4          : 1; /*  */
        uint8_t P1SEL5          : 1; /*  */
        uint8_t P1SEL6          : 1; /*  */
        uint8_t P1SEL7          : 1; /*  */
    } bits;
} P1SEL_t;

#define p_P1SEL                 ((P1SEL_t       *) 0x020Au)
#define P1SEL                   p_P1SEL->reg
#define P1SEL_bits              p_P1SEL->bits


