dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
typedef volatile union
{
    uint8_t reg;            /* Port 2 Select */
    struct
    {
        uint8_t P2SEL0          : 1; /*  */
        uint8_t P2SEL1          : 1; /*  */
        uint8_t P2SEL2          : 1; /*  */
        uint8_t P2SEL3          : 1; /*  */
        uint8_t P2SEL4          : 1; /*  */
        uint8_t P2SEL5          : 1; /*  */
        uint8_t P2SEL6          : 1; /*  */
        uint8_t P2SEL7          : 1; /*  */
    } bits;
} P2SEL_t;

#define p_P2SEL                 ((P2SEL_t       *) 0x020Bu)
#define P2SEL                   p_P2SEL->reg
#define P2SEL_bits              p_P2SEL->bits


typedef volatile union
{
    uint16_t reg;        /* Port A Select */
    struct
    {
        uint16_t PASEL0          : 1; /*  */
        uint16_t PASEL1          : 1; /*  */
        uint16_t PASEL2          : 1; /*  */
        uint16_t PASEL3          : 1; /*  */
        uint16_t PASEL4          : 1; /*  */
        uint16_t PASEL5          : 1; /*  */
        uint16_t PASEL6          : 1; /*  */
        uint16_t PASEL7          : 1; /*  */
        uint16_t PASEL8          : 1; /*  */
        uint16_t PASEL9          : 1; /*  */
        uint16_t PASEL10         : 1; /*  */
        uint16_t PASEL11         : 1; /*  */
        uint16_t PASEL12         : 1; /*  */
        uint16_t PASEL13         : 1; /*  */
        uint16_t PASEL14         : 1; /*  */
        uint16_t PASEL15         : 1; /*  */
    } bits;
} PASEL_t;

#define p_PASEL                 ((PASEL_t       *) 0x020Au)
#define PASEL                   p_PASEL->reg
#define PASEL_bits              p_PASEL->bits


/*%%%%% INTERRUPT VECTOR %%%%%*/

typedef volatile uint16_t P1IV_t;
#define p_P1IV                  ((P1IV_t       *) 0x020Eu)
#define P1IV                    * p_P1IV

typedef volatile uint16_t P2IV_t;
#define p_P2IV                  ((P2IV_t       *) 0x021Eu)
#define P2IV                    * p_P2IV


/*%%%%% INTERRUPT EDGE SELECT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 1 Interrupt Edge Select */
    struct
    {
        uint8_t P1IES0          : 1; /*  */
        uint8_t P1IES1          : 1; /*  */
        uint8_t P1IES2          : 1; /*  */
        uint8_t P1IES3          : 1; /*  */
        uint8_t P1IES4          : 1; /*  */
        uint8_t P1IES5          : 1; /*  */
        uint8_t P1IES6          : 1; /*  */
        uint8_t P1IES7          : 1; /*  */
    } bits;
} P1IES_t;

#define p_P1IES                 ((P1IES_t       *) 0x0218u)
#define P1IES                   p_P1IES->reg
#define P1IES_bits              p_P1IES->bits


typedef volatile union
{
    uint8_t reg;            /* Port 2 Interrupt Edge Select */
    struct
    {
        uint8_t P2IES0          : 1; /*  */
        uint8_t P2IES1          : 1; /*  */
        uint8_t P2IES2          : 1; /*  */
        uint8_t P2IES3          : 1; /*  */
        uint8_t P2IES4          : 1; /*  */
        uint8_t P2IES5          : 1; /*  */
        uint8_t P2IES6          : 1; /*  */
        uint8_t P2IES7          : 1; /*  */
    } bits;
} P2IES_t;

#define p_P2IES                 ((P2IES_t       *) 0x0219u)
#define P2IES                   p_P2IES->reg
#define P2IES_bits              p_P2IES->bits


typedef volatile union
{
    uint16_t reg;        /* Port A Interrupt Edge Select */
    struct
    {
        uint16_t PAIES0          : 1; /*  */
        uint16_t PAIES1          : 1; /*  */
        uint16_t PAIES2          : 1; /*  */
        uint16_t PAIES3          : 1; /*  */
        uint16_t PAIES4          : 1; /*  */
        uint16_t PAIES5          : 1; /*  */
        uint16_t PAIES6          : 1; /*  */
        uint16_t PAIES7          : 1; /*  */
        uint16_t PAIES8          : 1; /*  */
        uint16_t PAIES9          : 1; /*  */
        uint16_t PAIES10         : 1; /*  */
        uint16_t PAIES11         : 1; /*  */
        uint16_t PAIES12         : 1; /*  */
        uint16_t PAIES13         : 1; /*  */
        uint16_t PAIES14         : 1; /*  */
        uint16_t PAIES15         : 1; /*  */
    } bits;
} PAIES_t;

#define p_PAIES                 ((PAIES_t       *) 0x0218u)
#define PAIES                   p_PAIES->reg
#define PAIES_bits              p_PAIES->bits


/*%%%%% INTERRUPT ENABLE %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 1 Interrupt Enable */
    struct
    {
        uint8_t P1IE0          : 1; /*  */
        uint8_t P1IE1          : 1; /*  */
        uint8_t P1IE2          : 1; /*  */
        uint8_t P1IE3          : 1; /*  */
        uint8_t P1IE4          : 1; /*  */
        uint8_t P1IE5          : 1; /*  */
        uint8_t P1IE6          : 1; /*  */
        uint8_t P1IE7          : 1; /*  */
    } bits;
} P1IE_t;

#define p_P1IE                  ((P1IE_t        *) 0x021Au)
#define P1IE                    p_P1IE->reg
#define P1IE_bits               p_P1IE->bits


typedef volatile union
{
    uint8_t reg;            /* Port 2 Interrupt Enable */
    struct
    {
        uint8_t P2IE0          : 1; /*  */
        uint8_t P2IE1          : 1; /*  */
        uint8_t P2IE2          : 1; /*  */
        uint8_t P2IE3          : 1; /*  */
        uint8_t P2IE4          : 1; /*  */
        uint8_t P2IE5          : 1; /*  */
        uint8_t P2IE6          : 1; /*  */
        uint8_t P2IE7          : 1; /*  */
    } bits;
} P2IE_t;

#define p_P2IE                  ((P2IE_t        *) 0x021Bu)
#define P2IE                    p_P2IE->reg
#define P2IE_bits               p_P2IE->bits


typedef volatile union
{
    uint16_t reg;        /* Port A Interrupt Enable */
    struct
    {
        uint16_t PAIE0          : 1; /*  */
        uint16_t PAIE1          : 1; /*  */
        uint16_t PAIE2          : 1; /*  */
        uint16_t PAIE3          : 1; /*  */
        uint16_t PAIE4          : 1; /*  */
        uint16_t PAIE5          : 1; /*  */
        uint16_t PAIE6          : 1; /*  */
        uint16_t PAIE7          : 1; /*  */
        uint16_t PAIE8          : 1; /*  */
        uint16_t PAIE9          : 1; /*  */
        uint16_t PAIE10         : 1; /*  */
        uint16_t PAIE11         : 1; /*  */
        uint16_t PAIE12         : 1; /*  */
        uint16_t PAIE13         : 1; /*  */
        uint16_t PAIE14         : 1; /*  */
        uint16_t PAIE15         : 1; /*  */
    } bits;
} PAIE_t;

#define p_PAIE                  ((PAIE_t        *) 0x021Au)
#define PAIE                    p_PAIE->reg
#define PAIE_bits               p_PAIE->bits


/*%%%%% INTERRUPT FLAG %%%%%*/

