dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
typedef volatile union
{
    uint8_t reg;            /* Port 1 Interrupt Flag */
    struct
    {
        uint8_t P1IFG0          : 1; /*  */
        uint8_t P1IFG1          : 1; /*  */
        uint8_t P1IFG2          : 1; /*  */
        uint8_t P1IFG3          : 1; /*  */
        uint8_t P1IFG4          : 1; /*  */
        uint8_t P1IFG5          : 1; /*  */
        uint8_t P1IFG6          : 1; /*  */
        uint8_t P1IFG7          : 1; /*  */
    } bits;
} P1IFG_t;

#define p_P1IFG                 ((P1IFG_t       *) 0x021Cu)
#define P1IFG                   p_P1IFG->reg
#define P1IFG_bits              p_P1IFG->bits


typedef volatile union
{
    uint8_t reg;            /* Port 2 Interrupt Flag */
    struct
    {
        uint8_t P2IFG0          : 1; /*  */
        uint8_t P2IFG1          : 1; /*  */
        uint8_t P2IFG2          : 1; /*  */
        uint8_t P2IFG3          : 1; /*  */
        uint8_t P2IFG4          : 1; /*  */
        uint8_t P2IFG5          : 1; /*  */
        uint8_t P2IFG6          : 1; /*  */
        uint8_t P2IFG7          : 1; /*  */
    } bits;
} P2IFG_t;

#define p_P2IFG                 ((P2IFG_t       *) 0x021Du)
#define P2IFG                   p_P2IFG->reg
#define P2IFG_bits              p_P2IFG->bits


typedef volatile union
{
    uint16_t reg;        /* Port A Interrupt Flag */
    struct
    {
        uint16_t PAIFG0          : 1; /*  */
        uint16_t PAIFG1          : 1; /*  */
        uint16_t PAIFG2          : 1; /*  */
        uint16_t PAIFG3          : 1; /*  */
        uint16_t PAIFG4          : 1; /*  */
        uint16_t PAIFG5          : 1; /*  */
        uint16_t PAIFG6          : 1; /*  */
        uint16_t PAIFG7          : 1; /*  */
        uint16_t PAIFG8          : 1; /*  */
        uint16_t PAIFG9          : 1; /*  */
        uint16_t PAIFG10         : 1; /*  */
        uint16_t PAIFG11         : 1; /*  */
        uint16_t PAIFG12         : 1; /*  */
        uint16_t PAIFG13         : 1; /*  */
        uint16_t PAIFG14         : 1; /*  */
        uint16_t PAIFG15         : 1; /*  */
    } bits;
} PAIFG_t;

#define p_PAIFG                 ((PAIFG_t       *) 0x021Cu)
#define PAIFG                   p_PAIFG->reg
#define PAIFG_bits              p_PAIFG->bits







/*#############################################################################
 *   Port B (16-bit access), Ports 3 & 4 (8-bit access)
*############################################################################*/


/*%%%%% INPUT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 3 Input */
    struct
    {
        unsigned __READ char P3IN0           : 1; /*  */
        unsigned __READ char P3IN1           : 1; /*  */
        unsigned __READ char P3IN2           : 1; /*  */
        unsigned __READ char P3IN3           : 1; /*  */
        unsigned __READ char P3IN4           : 1; /*  */
        unsigned __READ char P3IN5           : 1; /*  */
        unsigned __READ char P3IN6           : 1; /*  */
        unsigned __READ char P3IN7           : 1; /*  */
    } bits;
} P3IN_t;

#define p_P3IN            ((P3IN_t        *) 0x0220u)
#define P3IN            p_P3IN->reg
#define P3IN_bits        p_P3IN->bits


typedef volatile union
{
    uint8_t reg;            /* Port 4 Input */
    struct
    {
        unsigned __READ char P4IN0           : 1; /*  */
        unsigned __READ char P4IN1           : 1; /*  */
        unsigned __READ char P4IN2           : 1; /*  */
        unsigned __READ char P4IN3           : 1; /*  */
        unsigned __READ char P4IN4           : 1; /*  */
        unsigned __READ char P4IN5           : 1; /*  */
        unsigned __READ char P4IN6           : 1; /*  */
        unsigned __READ char P4IN7           : 1; /*  */
    } bits;
} P4IN_t;

#define p_P4IN            ((P4IN_t        *) 0x0221u)
#define P4IN            p_P4IN->reg
#define P4IN_bits        p_P4IN->bits


typedef volatile union
{
    uint16_t reg;        /* Port B Input */
    struct
    {
        unsigned __READ short PBIN0           : 1; /*  */
        unsigned __READ short PBIN1           : 1; /*  */
        unsigned __READ short PBIN2           : 1; /*  */
        unsigned __READ short PBIN3           : 1; /*  */
        unsigned __READ short PBIN4           : 1; /*  */
        unsigned __READ short PBIN5           : 1; /*  */
        unsigned __READ short PBIN6           : 1; /*  */
        unsigned __READ short PBIN7           : 1; /*  */
        unsigned __READ short PBIN8           : 1; /*  */
        unsigned __READ short PBIN9           : 1; /*  */
        unsigned __READ short PBIN10          : 1; /*  */
        unsigned __READ short PBIN11          : 1; /*  */
        unsigned __READ short PBIN12          : 1; /*  */
        unsigned __READ short PBIN13          : 1; /*  */
        unsigned __READ short PBIN14          : 1; /*  */
        unsigned __READ short PBIN15          : 1; /*  */
    } bits;
} PBIN_t;

#define p_PBIN            ((PBIN_t        *) 0x0220u)
#define PBIN            p_PBIN->reg
#define PBIN_bits        p_PBIN->bits


/*%%%%% OUTPUT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 3 Output */
    struct
    {
        uint8_t P3OUT0           : 1; /*  */
        uint8_t P3OUT1           : 1; /*  */
        uint8_t P3OUT2           : 1; /*  */
        uint8_t P3OUT3           : 1; /*  */
        uint8_t P3OUT4           : 1; /*  */
        uint8_t P3OUT5           : 1; /*  */
        uint8_t P3OUT6           : 1; /*  */
        uint8_t P3OUT7           : 1; /*  */
    } bits;
} P3OUT_t;

#define p_P3OUT            ((P3OUT_t        *) 0x0222u)
#define P3OUT            p_P3OUT->reg
#define P3OUT_bits        p_P3OUT->bits


typedef volatile union
{
    uint8_t reg;            /* Port 4 Output */
    struct
    {
        uint8_t P4OUT0           : 1; /*  */
        uint8_t P4OUT1           : 1; /*  */
        uint8_t P4OUT2           : 1; /*  */
        uint8_t P4OUT3           : 1; /*  */
        uint8_t P4OUT4           : 1; /*  */
        uint8_t P4OUT5           : 1; /*  */
        uint8_t P4OUT6           : 1; /*  */
        uint8_t P4OUT7           : 1; /*  */
    } bits;
} P4OUT_t;

#define p_P4OUT            ((P4OUT_t        *) 0x0223u)
#define P4OUT            p_P4OUT->reg
#define P4OUT_bits        p_P4OUT->bits


