dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
typedef volatile union
{
    uint16_t reg;        /* Port B Output */
    struct
    {
        uint16_t PBOUT0           : 1; /*  */
        uint16_t PBOUT1           : 1; /*  */
        uint16_t PBOUT2           : 1; /*  */
        uint16_t PBOUT3           : 1; /*  */
        uint16_t PBOUT4           : 1; /*  */
        uint16_t PBOUT5           : 1; /*  */
        uint16_t PBOUT6           : 1; /*  */
        uint16_t PBOUT7           : 1; /*  */
        uint16_t PBOUT8           : 1; /*  */
        uint16_t PBOUT9           : 1; /*  */
        uint16_t PBOUT10          : 1; /*  */
        uint16_t PBOUT11          : 1; /*  */
        uint16_t PBOUT12          : 1; /*  */
        uint16_t PBOUT13          : 1; /*  */
        uint16_t PBOUT14          : 1; /*  */
        uint16_t PBOUT15          : 1; /*  */
    } bits;
} PBOUT_t;

#define p_PBOUT            ((PBOUT_t        *) 0x0222u)
#define PBOUT            p_PBOUT->reg
#define PBOUT_bits        p_PBOUT->bits


/*%%%%% DIRECTION %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 3 Direction */
    struct
    {
        uint8_t P3DIR0          : 1; /*  */
        uint8_t P3DIR1          : 1; /*  */
        uint8_t P3DIR2          : 1; /*  */
        uint8_t P3DIR3          : 1; /*  */
        uint8_t P3DIR4          : 1; /*  */
        uint8_t P3DIR5          : 1; /*  */
        uint8_t P3DIR6          : 1; /*  */
        uint8_t P3DIR7          : 1; /*  */
    } bits;
} P3DIR_t;

#define p_P3DIR            ((P3DIR_t        *) 0x0224u)
#define P3DIR            p_P3DIR->reg
#define P3DIR_bits        p_P3DIR->bits


typedef volatile union
{
    uint8_t reg;            /* Port 4 Direction */
    struct
    {
        uint8_t P4DIR0          : 1; /*  */
        uint8_t P4DIR1          : 1; /*  */
        uint8_t P4DIR2          : 1; /*  */
        uint8_t P4DIR3          : 1; /*  */
        uint8_t P4DIR4          : 1; /*  */
        uint8_t P4DIR5          : 1; /*  */
        uint8_t P4DIR6          : 1; /*  */
        uint8_t P4DIR7          : 1; /*  */
    } bits;
} P4DIR_t;

#define p_P4DIR            ((P4DIR_t        *) 0x0225u)
#define P4DIR            p_P4DIR->reg
#define P4DIR_bits        p_P4DIR->bits


typedef volatile union
{
    uint16_t reg;        /* Port B Direction */
    struct
    {
        uint16_t PBDIR0          : 1; /*  */
        uint16_t PBDIR1          : 1; /*  */
        uint16_t PBDIR2          : 1; /*  */
        uint16_t PBDIR3          : 1; /*  */
        uint16_t PBDIR4          : 1; /*  */
        uint16_t PBDIR5          : 1; /*  */
        uint16_t PBDIR6          : 1; /*  */
        uint16_t PBDIR7          : 1; /*  */
        uint16_t PBDIR8          : 1; /*  */
        uint16_t PBDIR9          : 1; /*  */
        uint16_t PBDIR10         : 1; /*  */
        uint16_t PBDIR11         : 1; /*  */
        uint16_t PBDIR12         : 1; /*  */
        uint16_t PBDIR13         : 1; /*  */
        uint16_t PBDIR14         : 1; /*  */
        uint16_t PBDIR15         : 1; /*  */
    } bits;
} PBDIR_t;

#define p_PBDIR            ((PBDIR_t        *) 0x0224u)
#define PBDIR            p_PBDIR->reg
#define PBDIR_bits        p_PBDIR->bits


/*%%%%% RESISTOR ENABLE %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 3 Resistor Enable */
    struct
    {
        uint8_t P3REN0          : 1; /*  */
        uint8_t P3REN1          : 1; /*  */
        uint8_t P3REN2          : 1; /*  */
        uint8_t P3REN3          : 1; /*  */
        uint8_t P3REN4          : 1; /*  */
        uint8_t P3REN5          : 1; /*  */
        uint8_t P3REN6          : 1; /*  */
        uint8_t P3REN7          : 1; /*  */
    } bits;
} P3REN_t;

#define p_P3REN            ((P3REN_t        *) 0x0226u)
#define P3REN            p_P3REN->reg
#define P3REN_bits        p_P3REN->bits


typedef volatile union
{
    uint8_t reg;            /* Port 4 Resistor Enable */
    struct
    {
        uint8_t P4REN0          : 1; /*  */
        uint8_t P4REN1          : 1; /*  */
        uint8_t P4REN2          : 1; /*  */
        uint8_t P4REN3          : 1; /*  */
        uint8_t P4REN4          : 1; /*  */
        uint8_t P4REN5          : 1; /*  */
        uint8_t P4REN6          : 1; /*  */
        uint8_t P4REN7          : 1; /*  */
    } bits;
} P4REN_t;

#define p_P4REN            ((P4REN_t        *) 0x0227u)
#define P4REN            p_P4REN->reg
#define P4REN_bits        p_P4REN->bits


typedef volatile union
{
    uint16_t reg;        /* Port B Resistor Enable */
    struct
    {
        uint16_t PBREN0          : 1; /*  */
        uint16_t PBREN1          : 1; /*  */
        uint16_t PBREN2          : 1; /*  */
        uint16_t PBREN3          : 1; /*  */
        uint16_t PBREN4          : 1; /*  */
        uint16_t PBREN5          : 1; /*  */
        uint16_t PBREN6          : 1; /*  */
        uint16_t PBREN7          : 1; /*  */
        uint16_t PBREN8          : 1; /*  */
        uint16_t PBREN9          : 1; /*  */
        uint16_t PBREN10         : 1; /*  */
        uint16_t PBREN11         : 1; /*  */
        uint16_t PBREN12         : 1; /*  */
        uint16_t PBREN13         : 1; /*  */
        uint16_t PBREN14         : 1; /*  */
        uint16_t PBREN15         : 1; /*  */
    } bits;
} PBREN_t;

#define p_PBREN            ((PBREN_t        *) 0x0226u)
#define PBREN            p_PBREN->reg
#define PBREN_bits        p_PBREN->bits


/*%%%%% DRIVE STRENGTH %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 3 Drive Strength */
    struct
    {
        uint8_t P3DS0          : 1; /*  */
        uint8_t P3DS1          : 1; /*  */
        uint8_t P3DS2          : 1; /*  */
        uint8_t P3DS3          : 1; /*  */
        uint8_t P3DS4          : 1; /*  */
        uint8_t P3DS5          : 1; /*  */
        uint8_t P3DS6          : 1; /*  */
        uint8_t P3DS7          : 1; /*  */
    } bits;
} P3DS_t;

#define p_P3DS            ((P3DS_t        *) 0x0228u)
#define P3DS            p_P3DS->reg
#define P3DS_bits        p_P3DS->bits


