dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
typedef volatile union
{
    uint8_t reg;            /* Port 4 Drive Strength */
    struct
    {
        uint8_t P4DS0          : 1; /*  */
        uint8_t P4DS1          : 1; /*  */
        uint8_t P4DS2          : 1; /*  */
        uint8_t P4DS3          : 1; /*  */
        uint8_t P4DS4          : 1; /*  */
        uint8_t P4DS5          : 1; /*  */
        uint8_t P4DS6          : 1; /*  */
        uint8_t P4DS7          : 1; /*  */
    } bits;
} P4DS_t;

#define p_P4DS            ((P4DS_t        *) 0x0229u)
#define P4DS            p_P4DS->reg
#define P4DS_bits        p_P4DS->bits


typedef volatile union
{
    uint16_t reg;        /* Port B Drive Strength */
    struct
    {
        uint16_t PBDS0          : 1; /*  */
        uint16_t PBDS1          : 1; /*  */
        uint16_t PBDS2          : 1; /*  */
        uint16_t PBDS3          : 1; /*  */
        uint16_t PBDS4          : 1; /*  */
        uint16_t PBDS5          : 1; /*  */
        uint16_t PBDS6          : 1; /*  */
        uint16_t PBDS7          : 1; /*  */
        uint16_t PBDS8          : 1; /*  */
        uint16_t PBDS9          : 1; /*  */
        uint16_t PBDS10         : 1; /*  */
        uint16_t PBDS11         : 1; /*  */
        uint16_t PBDS12         : 1; /*  */
        uint16_t PBDS13         : 1; /*  */
        uint16_t PBDS14         : 1; /*  */
        uint16_t PBDS15         : 1; /*  */
    } bits;
} PBDS_t;

#define p_PBDS            ((PBDS_t        *) 0x0228u)
#define PBDS            p_PBDS->reg
#define PBDS_bits        p_PBDS->bits


/*%%%%% SELECT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 3 Select */
    struct
    {
        uint8_t P3SEL0          : 1; /*  */
        uint8_t P3SEL1          : 1; /*  */
        uint8_t P3SEL2          : 1; /*  */
        uint8_t P3SEL3          : 1; /*  */
        uint8_t P3SEL4          : 1; /*  */
        uint8_t P3SEL5          : 1; /*  */
        uint8_t P3SEL6          : 1; /*  */
        uint8_t P3SEL7          : 1; /*  */
    } bits;
} P3SEL_t;

#define p_P3SEL            ((P3SEL_t        *) 0x022Au)
#define P3SEL            p_P3SEL->reg
#define P3SEL_bits        p_P3SEL->bits


typedef volatile union
{
    uint8_t reg;            /* Port 4 Select */
    struct
    {
        uint8_t P4SEL0          : 1; /*  */
        uint8_t P4SEL1          : 1; /*  */
        uint8_t P4SEL2          : 1; /*  */
        uint8_t P4SEL3          : 1; /*  */
        uint8_t P4SEL4          : 1; /*  */
        uint8_t P4SEL5          : 1; /*  */
        uint8_t P4SEL6          : 1; /*  */
        uint8_t P4SEL7          : 1; /*  */
    } bits;
} P4SEL_t;

#define p_P4SEL            ((P4SEL_t        *) 0x022Bu)
#define P4SEL            p_P4SEL->reg
#define P4SEL_bits        p_P4SEL->bits


typedef volatile union
{
    uint16_t reg;        /* Port B Select */
    struct
    {
        uint16_t PBSEL0          : 1; /*  */
        uint16_t PBSEL1          : 1; /*  */
        uint16_t PBSEL2          : 1; /*  */
        uint16_t PBSEL3          : 1; /*  */
        uint16_t PBSEL4          : 1; /*  */
        uint16_t PBSEL5          : 1; /*  */
        uint16_t PBSEL6          : 1; /*  */
        uint16_t PBSEL7          : 1; /*  */
        uint16_t PBSEL8          : 1; /*  */
        uint16_t PBSEL9          : 1; /*  */
        uint16_t PBSEL10         : 1; /*  */
        uint16_t PBSEL11         : 1; /*  */
        uint16_t PBSEL12         : 1; /*  */
        uint16_t PBSEL13         : 1; /*  */
        uint16_t PBSEL14         : 1; /*  */
        uint16_t PBSEL15         : 1; /*  */
    } bits;
} PBSEL_t;

#define p_PBSEL            ((PBSEL_t        *) 0x022Au)
#define PBSEL            p_PBSEL->reg
#define PBSEL_bits        p_PBSEL->bits







/*#############################################################################
 *   Port C (16-bit access), Ports 5 & 6 (8-bit access)
*############################################################################*/


/*%%%%% INPUT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 5 Input */
    struct
    {
        unsigned __READ char P5IN0           : 1; /*  */
        unsigned __READ char P5IN1           : 1; /*  */
        unsigned __READ char P5IN2           : 1; /*  */
        unsigned __READ char P5IN3           : 1; /*  */
        unsigned __READ char P5IN4           : 1; /*  */
        unsigned __READ char P5IN5           : 1; /*  */
        unsigned __READ char P5IN6           : 1; /*  */
        unsigned __READ char P5IN7           : 1; /*  */
    } bits;
} P5IN_t;

#define p_P5IN            ((P5IN_t        *) 0x0240u)
#define P5IN            p_P5IN->reg
#define P5IN_bits        p_P5IN->bits


typedef volatile union
{
    uint8_t reg;            /* Port 6 Input */
    struct
    {
        unsigned __READ char P6IN0           : 1; /*  */
        unsigned __READ char P6IN1           : 1; /*  */
        unsigned __READ char P6IN2           : 1; /*  */
        unsigned __READ char P6IN3           : 1; /*  */
        unsigned __READ char P6IN4           : 1; /*  */
        unsigned __READ char P6IN5           : 1; /*  */
        unsigned __READ char P6IN6           : 1; /*  */
        unsigned __READ char P6IN7           : 1; /*  */
    } bits;
} P6IN_t;

#define p_P6IN            ((P6IN_t        *) 0x0241u)
#define P6IN            p_P6IN->reg
#define P6IN_bits        p_P6IN->bits


typedef volatile union
{
    uint16_t reg;        /* Port C Input */
    struct
    {
        unsigned __READ short PCIN0           : 1; /*  */
        unsigned __READ short PCIN1           : 1; /*  */
        unsigned __READ short PCIN2           : 1; /*  */
        unsigned __READ short PCIN3           : 1; /*  */
        unsigned __READ short PCIN4           : 1; /*  */
        unsigned __READ short PCIN5           : 1; /*  */
        unsigned __READ short PCIN6           : 1; /*  */
        unsigned __READ short PCIN7           : 1; /*  */
        unsigned __READ short PCIN8           : 1; /*  */
        unsigned __READ short PCIN9           : 1; /*  */
        unsigned __READ short PCIN10          : 1; /*  */
        unsigned __READ short PCIN11          : 1; /*  */
        unsigned __READ short PCIN12          : 1; /*  */
        unsigned __READ short PCIN13          : 1; /*  */
        unsigned __READ short PCIN14          : 1; /*  */
        unsigned __READ short PCIN15          : 1; /*  */
    } bits;
} PCIN_t;

#define p_PCIN            ((PCIN_t        *) 0x0240u)
#define PCIN            p_PCIN->reg
#define PCIN_bits        p_PCIN->bits


