dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
/*%%%%% OUTPUT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 5 Output */
    struct
    {
        uint8_t P5OUT0           : 1; /*  */
        uint8_t P5OUT1           : 1; /*  */
        uint8_t P5OUT2           : 1; /*  */
        uint8_t P5OUT3           : 1; /*  */
        uint8_t P5OUT4           : 1; /*  */
        uint8_t P5OUT5           : 1; /*  */
        uint8_t P5OUT6           : 1; /*  */
        uint8_t P5OUT7           : 1; /*  */
    } bits;
} P5OUT_t;

#define p_P5OUT            ((P5OUT_t        *) 0x0242u)
#define P5OUT            p_P5OUT->reg
#define P5OUT_bits        p_P5OUT->bits


typedef volatile union
{
    uint8_t reg;            /* Port 6 Output */
    struct
    {
        uint8_t P6OUT0           : 1; /*  */
        uint8_t P6OUT1           : 1; /*  */
        uint8_t P6OUT2           : 1; /*  */
        uint8_t P6OUT3           : 1; /*  */
        uint8_t P6OUT4           : 1; /*  */
        uint8_t P6OUT5           : 1; /*  */
        uint8_t P6OUT6           : 1; /*  */
        uint8_t P6OUT7           : 1; /*  */
    } bits;
} P6OUT_t;

#define p_P6OUT            ((P6OUT_t        *) 0x0243u)
#define P6OUT            p_P6OUT->reg
#define P6OUT_bits        p_P6OUT->bits


typedef volatile union
{
    uint16_t reg;        /* Port C Output */
    struct
    {
        uint16_t PCOUT0           : 1; /*  */
        uint16_t PCOUT1           : 1; /*  */
        uint16_t PCOUT2           : 1; /*  */
        uint16_t PCOUT3           : 1; /*  */
        uint16_t PCOUT4           : 1; /*  */
        uint16_t PCOUT5           : 1; /*  */
        uint16_t PCOUT6           : 1; /*  */
        uint16_t PCOUT7           : 1; /*  */
        uint16_t PCOUT8           : 1; /*  */
        uint16_t PCOUT9           : 1; /*  */
        uint16_t PCOUT10          : 1; /*  */
        uint16_t PCOUT11          : 1; /*  */
        uint16_t PCOUT12          : 1; /*  */
        uint16_t PCOUT13          : 1; /*  */
        uint16_t PCOUT14          : 1; /*  */
        uint16_t PCOUT15          : 1; /*  */
    } bits;
} PCOUT_t;

#define p_PCOUT            ((PCOUT_t        *) 0x0242u)
#define PCOUT            p_PCOUT->reg
#define PCOUT_bits        p_PCOUT->bits


/*%%%%% DIRECTION %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 5 Direction */
    struct
    {
        uint8_t P5DIR0          : 1; /*  */
        uint8_t P5DIR1          : 1; /*  */
        uint8_t P5DIR2          : 1; /*  */
        uint8_t P5DIR3          : 1; /*  */
        uint8_t P5DIR4          : 1; /*  */
        uint8_t P5DIR5          : 1; /*  */
        uint8_t P5DIR6          : 1; /*  */
        uint8_t P5DIR7          : 1; /*  */
    } bits;
} P5DIR_t;

#define p_P5DIR            ((P5DIR_t        *) 0x0244u)
#define P5DIR            p_P5DIR->reg
#define P5DIR_bits        p_P5DIR->bits


typedef volatile union
{
    uint8_t reg;            /* Port 6 Direction */
    struct
    {
        uint8_t P6DIR0          : 1; /*  */
        uint8_t P6DIR1          : 1; /*  */
        uint8_t P6DIR2          : 1; /*  */
        uint8_t P6DIR3          : 1; /*  */
        uint8_t P6DIR4          : 1; /*  */
        uint8_t P6DIR5          : 1; /*  */
        uint8_t P6DIR6          : 1; /*  */
        uint8_t P6DIR7          : 1; /*  */
    } bits;
} P6DIR_t;

#define p_P6DIR            ((P6DIR_t        *) 0x0245u)
#define P6DIR            p_P6DIR->reg
#define P6DIR_bits        p_P6DIR->bits


typedef volatile union
{
    uint16_t reg;        /* Port C Direction */
    struct
    {
        uint16_t PCDIR0          : 1; /*  */
        uint16_t PCDIR1          : 1; /*  */
        uint16_t PCDIR2          : 1; /*  */
        uint16_t PCDIR3          : 1; /*  */
        uint16_t PCDIR4          : 1; /*  */
        uint16_t PCDIR5          : 1; /*  */
        uint16_t PCDIR6          : 1; /*  */
        uint16_t PCDIR7          : 1; /*  */
        uint16_t PCDIR8          : 1; /*  */
        uint16_t PCDIR9          : 1; /*  */
        uint16_t PCDIR10         : 1; /*  */
        uint16_t PCDIR11         : 1; /*  */
        uint16_t PCDIR12         : 1; /*  */
        uint16_t PCDIR13         : 1; /*  */
        uint16_t PCDIR14         : 1; /*  */
        uint16_t PCDIR15         : 1; /*  */
    } bits;
} PCDIR_t;

#define p_PCDIR            ((PCDIR_t        *) 0x0244u)
#define PCDIR            p_PCDIR->reg
#define PCDIR_bits        p_PCDIR->bits


/*%%%%% RESISTOR ENABLE %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 5 Resistor Enable */
    struct
    {
        uint8_t P5REN0          : 1; /*  */
        uint8_t P5REN1          : 1; /*  */
        uint8_t P5REN2          : 1; /*  */
        uint8_t P5REN3          : 1; /*  */
        uint8_t P5REN4          : 1; /*  */
        uint8_t P5REN5          : 1; /*  */
        uint8_t P5REN6          : 1; /*  */
        uint8_t P5REN7          : 1; /*  */
    } bits;
} P5REN_t;

#define p_P5REN            ((P5REN_t        *) 0x0246u)
#define P5REN            p_P5REN->reg
#define P5REN_bits        p_P5REN->bits


typedef volatile union
{
    uint8_t reg;            /* Port 6 Resistor Enable */
    struct
    {
        uint8_t P6REN0          : 1; /*  */
        uint8_t P6REN1          : 1; /*  */
        uint8_t P6REN2          : 1; /*  */
        uint8_t P6REN3          : 1; /*  */
        uint8_t P6REN4          : 1; /*  */
        uint8_t P6REN5          : 1; /*  */
        uint8_t P6REN6          : 1; /*  */
        uint8_t P6REN7          : 1; /*  */
    } bits;
} P6REN_t;

#define p_P6REN            ((P6REN_t        *) 0x0247u)
#define P6REN            p_P6REN->reg
#define P6REN_bits        p_P6REN->bits


typedef volatile union
{
    uint16_t reg;        /* Port C Resistor Enable */
    struct
    {
        uint16_t PCREN0          : 1; /*  */
        uint16_t PCREN1          : 1; /*  */
        uint16_t PCREN2          : 1; /*  */
        uint16_t PCREN3          : 1; /*  */
        uint16_t PCREN4          : 1; /*  */
        uint16_t PCREN5          : 1; /*  */
        uint16_t PCREN6          : 1; /*  */
        uint16_t PCREN7          : 1; /*  */
        uint16_t PCREN8          : 1; /*  */
        uint16_t PCREN9          : 1; /*  */
        uint16_t PCREN10         : 1; /*  */
        uint16_t PCREN11         : 1; /*  */
        uint16_t PCREN12         : 1; /*  */
        uint16_t PCREN13         : 1; /*  */
        uint16_t PCREN14         : 1; /*  */
        uint16_t PCREN15         : 1; /*  */
    } bits;
} PCREN_t;

#define p_PCREN            ((PCREN_t        *) 0x0246u)
#define PCREN            p_PCREN->reg
#define PCREN_bits        p_PCREN->bits


/*%%%%% DRIVE STRENGTH %%%%%*/

