dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
typedef volatile union
{
    uint8_t reg;            /* Port 5 Drive Strength */
    struct
    {
        uint8_t P5DS0          : 1; /*  */
        uint8_t P5DS1          : 1; /*  */
        uint8_t P5DS2          : 1; /*  */
        uint8_t P5DS3          : 1; /*  */
        uint8_t P5DS4          : 1; /*  */
        uint8_t P5DS5          : 1; /*  */
        uint8_t P5DS6          : 1; /*  */
        uint8_t P5DS7          : 1; /*  */
    } bits;
} P5DS_t;

#define p_P5DS            ((P5DS_t        *) 0x0248u)
#define P5DS            p_P5DS->reg
#define P5DS_bits        p_P5DS->bits


typedef volatile union
{
    uint8_t reg;            /* Port 6 Drive Strength */
    struct
    {
        uint8_t P6DS0          : 1; /*  */
        uint8_t P6DS1          : 1; /*  */
        uint8_t P6DS2          : 1; /*  */
        uint8_t P6DS3          : 1; /*  */
        uint8_t P6DS4          : 1; /*  */
        uint8_t P6DS5          : 1; /*  */
        uint8_t P6DS6          : 1; /*  */
        uint8_t P6DS7          : 1; /*  */
    } bits;
} P6DS_t;

#define p_P6DS            ((P6DS_t        *) 0x0249u)
#define P6DS            p_P6DS->reg
#define P6DS_bits        p_P6DS->bits


typedef volatile union
{
    uint16_t reg;        /* Port C Drive Strength */
    struct
    {
        uint16_t PCDS0          : 1; /*  */
        uint16_t PCDS1          : 1; /*  */
        uint16_t PCDS2          : 1; /*  */
        uint16_t PCDS3          : 1; /*  */
        uint16_t PCDS4          : 1; /*  */
        uint16_t PCDS5          : 1; /*  */
        uint16_t PCDS6          : 1; /*  */
        uint16_t PCDS7          : 1; /*  */
        uint16_t PCDS8          : 1; /*  */
        uint16_t PCDS9          : 1; /*  */
        uint16_t PCDS10         : 1; /*  */
        uint16_t PCDS11         : 1; /*  */
        uint16_t PCDS12         : 1; /*  */
        uint16_t PCDS13         : 1; /*  */
        uint16_t PCDS14         : 1; /*  */
        uint16_t PCDS15         : 1; /*  */
    } bits;
} PCDS_t;

#define p_PCDS            ((PCDS_t        *) 0x0248u)
#define PCDS            p_PCDS->reg
#define PCDS_bits        p_PCDS->bits


/*%%%%% SELECT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 5 Select */
    struct
    {
        uint8_t P5SEL0          : 1; /*  */
        uint8_t P5SEL1          : 1; /*  */
        uint8_t P5SEL2          : 1; /*  */
        uint8_t P5SEL3          : 1; /*  */
        uint8_t P5SEL4          : 1; /*  */
        uint8_t P5SEL5          : 1; /*  */
        uint8_t P5SEL6          : 1; /*  */
        uint8_t P5SEL7          : 1; /*  */
    } bits;
} P5SEL_t;

#define p_P5SEL            ((P5SEL_t        *) 0x024Au)
#define P5SEL            p_P5SEL->reg
#define P5SEL_bits        p_P5SEL->bits


typedef volatile union
{
    uint8_t reg;            /* Port 6 Select */
    struct
    {
        uint8_t P6SEL0          : 1; /*  */
        uint8_t P6SEL1          : 1; /*  */
        uint8_t P6SEL2          : 1; /*  */
        uint8_t P6SEL3          : 1; /*  */
        uint8_t P6SEL4          : 1; /*  */
        uint8_t P6SEL5          : 1; /*  */
        uint8_t P6SEL6          : 1; /*  */
        uint8_t P6SEL7          : 1; /*  */
    } bits;
} P6SEL_t;

#define p_P6SEL            ((P6SEL_t        *) 0x024Bu)
#define P6SEL            p_P6SEL->reg
#define P6SEL_bits        p_P6SEL->bits


typedef volatile union
{
    uint16_t reg;        /* Port C Select */
    struct
    {
        uint16_t PCSEL0          : 1; /*  */
        uint16_t PCSEL1          : 1; /*  */
        uint16_t PCSEL2          : 1; /*  */
        uint16_t PCSEL3          : 1; /*  */
        uint16_t PCSEL4          : 1; /*  */
        uint16_t PCSEL5          : 1; /*  */
        uint16_t PCSEL6          : 1; /*  */
        uint16_t PCSEL7          : 1; /*  */
        uint16_t PCSEL8          : 1; /*  */
        uint16_t PCSEL9          : 1; /*  */
        uint16_t PCSEL10         : 1; /*  */
        uint16_t PCSEL11         : 1; /*  */
        uint16_t PCSEL12         : 1; /*  */
        uint16_t PCSEL13         : 1; /*  */
        uint16_t PCSEL14         : 1; /*  */
        uint16_t PCSEL15         : 1; /*  */
    } bits;
} PCSEL_t;

#define p_PCSEL            ((PCSEL_t        *) 0x024Au)
#define PCSEL            p_PCSEL->reg
#define PCSEL_bits        p_PCSEL->bits







/*#############################################################################
 *   Port D (16-bit access), Ports 7 & 8 (8-bit access)
*############################################################################*/


/*%%%%% INPUT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 7 Input */
    struct
    {
        unsigned __READ char P7IN0           : 1; /*  */
        unsigned __READ char P7IN1           : 1; /*  */
        unsigned __READ char P7IN2           : 1; /*  */
        unsigned __READ char P7IN3           : 1; /*  */
        unsigned __READ char P7IN4           : 1; /*  */
        unsigned __READ char P7IN5           : 1; /*  */
        unsigned __READ char P7IN6           : 1; /*  */
        unsigned __READ char P7IN7           : 1; /*  */
    } bits;
} P7IN_t;

#define p_P7IN            ((P7IN_t        *) 0x0260u)
#define P7IN            p_P7IN->reg
#define P7IN_bits        p_P7IN->bits


typedef volatile union
{
    uint8_t reg;            /* Port 8 Input */
    struct
    {
        unsigned __READ char P8IN0           : 1; /*  */
        unsigned __READ char P8IN1           : 1; /*  */
        unsigned __READ char P8IN2           : 1; /*  */
        unsigned __READ char P8IN3           : 1; /*  */
        unsigned __READ char P8IN4           : 1; /*  */
        unsigned __READ char P8IN5           : 1; /*  */
        unsigned __READ char P8IN6           : 1; /*  */
        unsigned __READ char P8IN7           : 1; /*  */
    } bits;
} P8IN_t;

#define p_P8IN            ((P8IN_t        *) 0x0261u)
#define P8IN            p_P8IN->reg
#define P8IN_bits        p_P8IN->bits


typedef volatile union
{
    uint16_t reg;        /* Port D Input */
    struct
    {
        unsigned __READ short PDIN0           : 1; /*  */
        unsigned __READ short PDIN1           : 1; /*  */
        unsigned __READ short PDIN2           : 1; /*  */
        unsigned __READ short PDIN3           : 1; /*  */
        unsigned __READ short PDIN4           : 1; /*  */
        unsigned __READ short PDIN5           : 1; /*  */
        unsigned __READ short PDIN6           : 1; /*  */
        unsigned __READ short PDIN7           : 1; /*  */
        unsigned __READ short PDIN8           : 1; /*  */
        unsigned __READ short PDIN9           : 1; /*  */
        unsigned __READ short PDIN10          : 1; /*  */
        unsigned __READ short PDIN11          : 1; /*  */
        unsigned __READ short PDIN12          : 1; /*  */
        unsigned __READ short PDIN13          : 1; /*  */
        unsigned __READ short PDIN14          : 1; /*  */
        unsigned __READ short PDIN15          : 1; /*  */
    } bits;
} PDIN_t;

#define p_PDIN            ((PDIN_t        *) 0x0260u)
#define PDIN            p_PDIN->reg
#define PDIN_bits        p_PDIN->bits


