dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
/*%%%%% OUTPUT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 7 Output */
    struct
    {
        uint8_t P7OUT0           : 1; /*  */
        uint8_t P7OUT1           : 1; /*  */
        uint8_t P7OUT2           : 1; /*  */
        uint8_t P7OUT3           : 1; /*  */
        uint8_t P7OUT4           : 1; /*  */
        uint8_t P7OUT5           : 1; /*  */
        uint8_t P7OUT6           : 1; /*  */
        uint8_t P7OUT7           : 1; /*  */
    } bits;
} P7OUT_t;

#define p_P7OUT            ((P7OUT_t        *) 0x0262u)
#define P7OUT            p_P7OUT->reg
#define P7OUT_bits        p_P7OUT->bits


typedef volatile union
{
    uint8_t reg;            /* Port 8 Output */
    struct
    {
        uint8_t P8OUT0           : 1; /*  */
        uint8_t P8OUT1           : 1; /*  */
        uint8_t P8OUT2           : 1; /*  */
        uint8_t P8OUT3           : 1; /*  */
        uint8_t P8OUT4           : 1; /*  */
        uint8_t P8OUT5           : 1; /*  */
        uint8_t P8OUT6           : 1; /*  */
        uint8_t P8OUT7           : 1; /*  */
    } bits;
} P8OUT_t;

#define p_P8OUT            ((P8OUT_t        *) 0x0263u)
#define P8OUT            p_P8OUT->reg
#define P8OUT_bits        p_P8OUT->bits


typedef volatile union
{
    uint16_t reg;        /* Port D Output */
    struct
    {
        uint16_t PDOUT0           : 1; /*  */
        uint16_t PDOUT1           : 1; /*  */
        uint16_t PDOUT2           : 1; /*  */
        uint16_t PDOUT3           : 1; /*  */
        uint16_t PDOUT4           : 1; /*  */
        uint16_t PDOUT5           : 1; /*  */
        uint16_t PDOUT6           : 1; /*  */
        uint16_t PDOUT7           : 1; /*  */
        uint16_t PDOUT8           : 1; /*  */
        uint16_t PDOUT9           : 1; /*  */
        uint16_t PDOUT10          : 1; /*  */
        uint16_t PDOUT11          : 1; /*  */
        uint16_t PDOUT12          : 1; /*  */
        uint16_t PDOUT13          : 1; /*  */
        uint16_t PDOUT14          : 1; /*  */
        uint16_t PDOUT15          : 1; /*  */
    } bits;
} PDOUT_t;

#define p_PDOUT            ((PDOUT_t        *) 0x0262u)
#define PDOUT            p_PDOUT->reg
#define PDOUT_bits        p_PDOUT->bits


/*%%%%% DIRECTION %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 7 Direction */
    struct
    {
        uint8_t P7DIR0          : 1; /*  */
        uint8_t P7DIR1          : 1; /*  */
        uint8_t P7DIR2          : 1; /*  */
        uint8_t P7DIR3          : 1; /*  */
        uint8_t P7DIR4          : 1; /*  */
        uint8_t P7DIR5          : 1; /*  */
        uint8_t P7DIR6          : 1; /*  */
        uint8_t P7DIR7          : 1; /*  */
    } bits;
} P7DIR_t;

#define p_P7DIR            ((P7DIR_t        *) 0x0264u)
#define P7DIR            p_P7DIR->reg
#define P7DIR_bits        p_P7DIR->bits


typedef volatile union
{
    uint8_t reg;            /* Port 8 Direction */
    struct
    {
        uint8_t P8DIR0          : 1; /*  */
        uint8_t P8DIR1          : 1; /*  */
        uint8_t P8DIR2          : 1; /*  */
        uint8_t P8DIR3          : 1; /*  */
        uint8_t P8DIR4          : 1; /*  */
        uint8_t P8DIR5          : 1; /*  */
        uint8_t P8DIR6          : 1; /*  */
        uint8_t P8DIR7          : 1; /*  */
    } bits;
} P8DIR_t;

#define p_P8DIR            ((P8DIR_t        *) 0x0265u)
#define P8DIR            p_P8DIR->reg
#define P8DIR_bits        p_P8DIR->bits


typedef volatile union
{
    uint16_t reg;        /* Port D Direction */
    struct
    {
        uint16_t PDDIR0          : 1; /*  */
        uint16_t PDDIR1          : 1; /*  */
        uint16_t PDDIR2          : 1; /*  */
        uint16_t PDDIR3          : 1; /*  */
        uint16_t PDDIR4          : 1; /*  */
        uint16_t PDDIR5          : 1; /*  */
        uint16_t PDDIR6          : 1; /*  */
        uint16_t PDDIR7          : 1; /*  */
        uint16_t PDDIR8          : 1; /*  */
        uint16_t PDDIR9          : 1; /*  */
        uint16_t PDDIR10         : 1; /*  */
        uint16_t PDDIR11         : 1; /*  */
        uint16_t PDDIR12         : 1; /*  */
        uint16_t PDDIR13         : 1; /*  */
        uint16_t PDDIR14         : 1; /*  */
        uint16_t PDDIR15         : 1; /*  */
    } bits;
} PDDIR_t;

#define p_PDDIR            ((PDDIR_t        *) 0x0264u)
#define PDDIR            p_PDDIR->reg
#define PDDIR_bits        p_PDDIR->bits


/*%%%%% RESISTOR ENABLE %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 7 Resistor Enable */
    struct
    {
        uint8_t P7REN0          : 1; /*  */
        uint8_t P7REN1          : 1; /*  */
        uint8_t P7REN2          : 1; /*  */
        uint8_t P7REN3          : 1; /*  */
        uint8_t P7REN4          : 1; /*  */
        uint8_t P7REN5          : 1; /*  */
        uint8_t P7REN6          : 1; /*  */
        uint8_t P7REN7          : 1; /*  */
    } bits;
} P7REN_t;

#define p_P7REN            ((P7REN_t        *) 0x0266u)
#define P7REN            p_P7REN->reg
#define P7REN_bits        p_P7REN->bits


typedef volatile union
{
    uint8_t reg;            /* Port 8 Resistor Enable */
    struct
    {
        uint8_t P8REN0          : 1; /*  */
        uint8_t P8REN1          : 1; /*  */
        uint8_t P8REN2          : 1; /*  */
        uint8_t P8REN3          : 1; /*  */
        uint8_t P8REN4          : 1; /*  */
        uint8_t P8REN5          : 1; /*  */
        uint8_t P8REN6          : 1; /*  */
        uint8_t P8REN7          : 1; /*  */
    } bits;
} P8REN_t;

#define p_P8REN            ((P8REN_t        *) 0x0267u)
#define P8REN            p_P8REN->reg
#define P8REN_bits        p_P8REN->bits


typedef volatile union
{
    uint16_t reg;        /* Port D Resistor Enable */
    struct
    {
        uint16_t PDREN0          : 1; /*  */
        uint16_t PDREN1          : 1; /*  */
        uint16_t PDREN2          : 1; /*  */
        uint16_t PDREN3          : 1; /*  */
        uint16_t PDREN4          : 1; /*  */
        uint16_t PDREN5          : 1; /*  */
        uint16_t PDREN6          : 1; /*  */
        uint16_t PDREN7          : 1; /*  */
        uint16_t PDREN8          : 1; /*  */
        uint16_t PDREN9          : 1; /*  */
        uint16_t PDREN10         : 1; /*  */
        uint16_t PDREN11         : 1; /*  */
        uint16_t PDREN12         : 1; /*  */
        uint16_t PDREN13         : 1; /*  */
        uint16_t PDREN14         : 1; /*  */
        uint16_t PDREN15         : 1; /*  */
    } bits;
} PDREN_t;

