dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
#define p_PDREN            ((PDREN_t        *) 0x0266u)
#define PDREN            p_PDREN->reg
#define PDREN_bits        p_PDREN->bits


/*%%%%% DRIVE STRENGTH %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 7 Drive Strength */
    struct
    {
        uint8_t P7DS0          : 1; /*  */
        uint8_t P7DS1          : 1; /*  */
        uint8_t P7DS2          : 1; /*  */
        uint8_t P7DS3          : 1; /*  */
        uint8_t P7DS4          : 1; /*  */
        uint8_t P7DS5          : 1; /*  */
        uint8_t P7DS6          : 1; /*  */
        uint8_t P7DS7          : 1; /*  */
    } bits;
} P7DS_t;

#define p_P7DS            ((P7DS_t        *) 0x0268u)
#define P7DS            p_P7DS->reg
#define P7DS_bits        p_P7DS->bits


typedef volatile union
{
    uint8_t reg;            /* Port 8 Drive Strength */
    struct
    {
        uint8_t P8DS0          : 1; /*  */
        uint8_t P8DS1          : 1; /*  */
        uint8_t P8DS2          : 1; /*  */
        uint8_t P8DS3          : 1; /*  */
        uint8_t P8DS4          : 1; /*  */
        uint8_t P8DS5          : 1; /*  */
        uint8_t P8DS6          : 1; /*  */
        uint8_t P8DS7          : 1; /*  */
    } bits;
} P8DS_t;

#define p_P8DS            ((P8DS_t        *) 0x0269u)
#define P8DS            p_P8DS->reg
#define P8DS_bits        p_P8DS->bits


typedef volatile union
{
    uint16_t reg;        /* Port D Drive Strength */
    struct
    {
        uint16_t PDDS0          : 1; /*  */
        uint16_t PDDS1          : 1; /*  */
        uint16_t PDDS2          : 1; /*  */
        uint16_t PDDS3          : 1; /*  */
        uint16_t PDDS4          : 1; /*  */
        uint16_t PDDS5          : 1; /*  */
        uint16_t PDDS6          : 1; /*  */
        uint16_t PDDS7          : 1; /*  */
        uint16_t PDDS8          : 1; /*  */
        uint16_t PDDS9          : 1; /*  */
        uint16_t PDDS10         : 1; /*  */
        uint16_t PDDS11         : 1; /*  */
        uint16_t PDDS12         : 1; /*  */
        uint16_t PDDS13         : 1; /*  */
        uint16_t PDDS14         : 1; /*  */
        uint16_t PDDS15         : 1; /*  */
    } bits;
} PDDS_t;

#define p_PDDS            ((PDDS_t        *) 0x0268u)
#define PDDS            p_PDDS->reg
#define PDDS_bits        p_PDDS->bits


/*%%%%% SELECT %%%%%*/

typedef volatile union
{
    uint8_t reg;            /* Port 7 Select */
    struct
    {
        uint8_t P7SEL0          : 1; /*  */
        uint8_t P7SEL1          : 1; /*  */
        uint8_t P7SEL2          : 1; /*  */
        uint8_t P7SEL3          : 1; /*  */
        uint8_t P7SEL4          : 1; /*  */
        uint8_t P7SEL5          : 1; /*  */
        uint8_t P7SEL6          : 1; /*  */
        uint8_t P7SEL7          : 1; /*  */
    } bits;
} P7SEL_t;

#define p_P7SEL            ((P7SEL_t        *) 0x026Au)
#define P7SEL            p_P7SEL->reg
#define P7SEL_bits        p_P7SEL->bits


typedef volatile union
{
    uint8_t reg;            /* Port 8 Select */
    struct
    {
        uint8_t P8SEL0          : 1; /*  */
        uint8_t P8SEL1          : 1; /*  */
        uint8_t P8SEL2          : 1; /*  */
        uint8_t P8SEL3          : 1; /*  */
        uint8_t P8SEL4          : 1; /*  */
        uint8_t P8SEL5          : 1; /*  */
        uint8_t P8SEL6          : 1; /*  */
        uint8_t P8SEL7          : 1; /*  */
    } bits;
} P8SEL_t;

#define p_P8SEL            ((P8SEL_t        *) 0x026Bu)
#define P8SEL            p_P8SEL->reg
#define P8SEL_bits        p_P8SEL->bits


typedef volatile union
{
    uint16_t reg;        /* Port D Select */
    struct
    {
        uint16_t PDSEL0          : 1; /*  */
        uint16_t PDSEL1          : 1; /*  */
        uint16_t PDSEL2          : 1; /*  */
        uint16_t PDSEL3          : 1; /*  */
        uint16_t PDSEL4          : 1; /*  */
        uint16_t PDSEL5          : 1; /*  */
        uint16_t PDSEL6          : 1; /*  */
        uint16_t PDSEL7          : 1; /*  */
        uint16_t PDSEL8          : 1; /*  */
        uint16_t PDSEL9          : 1; /*  */
        uint16_t PDSEL10         : 1; /*  */
        uint16_t PDSEL11         : 1; /*  */
        uint16_t PDSEL12         : 1; /*  */
        uint16_t PDSEL13         : 1; /*  */
        uint16_t PDSEL14         : 1; /*  */
        uint16_t PDSEL15         : 1; /*  */
    } bits;
} PDSEL_t;

#define p_PDSEL            ((PDSEL_t        *) 0x026Au)
#define PDSEL            p_PDSEL->reg
#define PDSEL_bits        p_PDSEL->bits







/*#############################################################################
 *   Port J (8-bit access only)
*############################################################################*/


/*%%%%% INPUT %%%%%*/

typedef volatile union
{
    uint8_t reg;      /* Port J Input */
    struct
    {
        unsigned __READ char PJIN0           : 1; /*  */
        unsigned __READ char PJIN1           : 1; /*  */
        unsigned __READ char PJIN2           : 1; /*  */
        unsigned __READ char PJIN3           : 1; /*  */
        unsigned __READ char PJIN4           : 1; /*  */
        unsigned __READ char PJIN5           : 1; /*  */
        unsigned __READ char PJIN6           : 1; /*  */
        unsigned __READ char PJIN7           : 1; /*  */
    } bits;
} PJIN_t;

#define p_PJIN                  ((PJIN_t            *) 0x0320u)
#define PJIN                    p_PJIN->reg
#define PJIN_bits               p_PJIN->bits


/*%%%%% OUTPUT %%%%%*/

typedef volatile union
{
    uint8_t reg;      /* Port J Output */
    struct
    {
        uint8_t PJOUT0           : 1; /*  */
        uint8_t PJOUT1           : 1; /*  */
        uint8_t PJOUT2           : 1; /*  */
        uint8_t PJOUT3           : 1; /*  */
        uint8_t PJOUT4           : 1; /*  */
        uint8_t PJOUT5           : 1; /*  */
        uint8_t PJOUT6           : 1; /*  */
        uint8_t PJOUT7           : 1; /*  */
    } bits;
} PJOUT_t;

#define p_PJOUT                 ((PJOUT_t           *) 0x0322u)
#define PJOUT                   p_PJOUT->reg
#define PJOUT_bits              p_PJOUT->bits


/*%%%%% DIRECTION %%%%%*/

