dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
typedef volatile union
{
    uint8_t reg;      /* Port J Direction */
    struct
    {
        uint8_t PJDIR0          : 1; /*  */
        uint8_t PJDIR1          : 1; /*  */
        uint8_t PJDIR2          : 1; /*  */
        uint8_t PJDIR3          : 1; /*  */
        uint8_t PJDIR4          : 1; /*  */
        uint8_t PJDIR5          : 1; /*  */
        uint8_t PJDIR6          : 1; /*  */
        uint8_t PJDIR7          : 1; /*  */
    } bits;
} PJDIR_t;

#define p_PJDIR                 ((PJDIR_t           *) 0x0324u)
#define PJDIR                   p_PJDIR->reg
#define PJDIR_bits              p_PJDIR->bits


/*%%%%% RESISTOR ENABLE %%%%%*/

typedef volatile union
{
    uint8_t reg;      /* Port J Resistor Enable */
    struct
    {
        uint8_t PJREN0          : 1; /*  */
        uint8_t PJREN1          : 1; /*  */
        uint8_t PJREN2          : 1; /*  */
        uint8_t PJREN3          : 1; /*  */
        uint8_t PJREN4          : 1; /*  */
        uint8_t PJREN5          : 1; /*  */
        uint8_t PJREN6          : 1; /*  */
        uint8_t PJREN7          : 1; /*  */
    } bits;
} PJREN_t;

#define p_PJREN                 ((PJREN_t           *) 0x0326u)
#define PJREN                   p_PJREN->reg
#define PJREN_bits              p_PJREN->bits


/*%%%%% DRIVE STRENGTH %%%%%*/

typedef volatile union
{
    uint8_t reg;      /* Port J Drive Strength */
    struct
    {
        uint8_t PJDS0          : 1; /*  */
        uint8_t PJDS1          : 1; /*  */
        uint8_t PJDS2          : 1; /*  */
        uint8_t PJDS3          : 1; /*  */
        uint8_t PJDS4          : 1; /*  */
        uint8_t PJDS5          : 1; /*  */
        uint8_t PJDS6          : 1; /*  */
        uint8_t PJDS7          : 1; /*  */
    } bits;
} PJDS_t;

#define p_PJDS                  ((PJDS_t            *) 0x0328u)
#define PJDS                    p_PJDS->reg
#define PJDS_bits               p_PJDS->bits







/*#########################################################################
 *   Port Mapping Control
*##########################################################################*/


/* Port Mapping Key register */
typedef volatile uint16_t PMAPKEYID_t;
#define p_PMAPKEYID                 ((PMAPKEYID_t     *) 0x01C0u)
#define PMAPKEYID                   *p_PMAPKEYID


typedef volatile union
{
    uint16_t reg;   /* Port Mapping control register */
    struct
    {
        uint16_t PMAPLOCKED           : 1; /* Port Mapping Lock bit. Read only */
        uint16_t PMAPRECFG            : 1; /* Port Mapping re-configuration control bit */
    } bits;
} PMAPCTL_t;

#define p_PMAPCTL                   ((PMAPCTL_t            *) 0x01C2u)
#define PMAPCTL                     p_PMAPCTL->reg
#define PMAPCTL_bits                p_PMAPCTL->bits



#define PM_NONE         0       /* INPUT: None, OUTPUT: DVSS */
#define PM_CBOUT0       1       /* INPUT: n/a, OUTPUT: Comparator_B output */
#define PM_TB0CLK       1       /* INPUT: TB0 clock input, OUTPUT: n/a */
#define PM_ADC12CLK     2       /* INPUT: n/a, OUTPUT: ADC12CLK */
#define PM_DMAE0        2       /* INPUT: DMAE0 input, OUTPUT: n/a */
#define PM_SVMOUT       3       /* INPUT: n/a, OUTPUT: SVM output */
#define PM_TB0OUTH      3       /* INPUT: TB0 high impedance input TB0OUTH, OUTPUT: n/a */
#define PM_TB0CCR0A     4       /* INPUT: TB0 CCR0 capture input CCI0A, OUTPUT: TB0 CCR0 compare output Out0 */
#define PM_TB0CCR1A     5       /* INPUT: TB0 CCR1 capture input CCI1A, OUTPUT: TB0 CCR1 compare output Out1 */
#define PM_TB0CCR2A     6       /* INPUT: TB0 CCR2 capture input CCI2A, OUTPUT: TB0 CCR2 compare output Out2 */
#define PM_TB0CCR3A     7       /* INPUT: TB0 CCR3 capture input CCI3A, OUTPUT: TB0 CCR3 compare output Out3 */
#define PM_TB0CCR4A     8       /* INPUT: TB0 CCR4 capture input CCI4A, OUTPUT: TB0 CCR4 compare output Out4 */
#define PM_TB0CCR5A     9       /* INPUT: TB0 CCR5 capture input CCI5A, OUTPUT: TB0 CCR5 compare output Out5 */
#define PM_TB0CCR6A     10      /* INPUT: TB0 CCR6 capture input CCI6A, OUTPUT: TB0 CCR6 compare output Out6 */
#define PM_UCA1RXD      11      /* USCI_A1 UART RXD (Direction controlled by USCI - input) */
#define PM_UCA1SOMI     11      /* USCI_A1 SPI slave out master in (direction controlled by USCI) */
#define PM_UCA1TXD      12      /* USCI_A1 UART TXD (Direction controlled by USCI - output) */
#define PM_UCA1SIMO     12      /* USCI_A1 SPI slave in master out (direction controlled by USCI) */
#define PM_UCA1CLK      13      /* USCI_A1 clock input/output (direction controlled by USCI) */
#define PM_UCB1STE      13      /* USCI_B1 SPI slave transmit enable (direction controlled by USCI) */
#define PM_UCB1SOMI     14      /* USCI_B1 SPI slave out master in (direction controlled by USCI) */
#define PM_UCB1SCL      14      /* USCI_B1 I2C clock (open drain and direction controlled by USCI) */
#define PM_UCB1SIMO     15      /* USCI_B1 SPI slave in master out (direction controlled by USCI) */
#define PM_UCB1SDA      15      /* USCI_B1 I2C data (open drain and direction controlled by USCI) */
#define PM_UCB1CLK      16      /* USCI_B1 clock input/output (direction controlled by USCI) */
#define PM_UCA1STE      16      /* USCI_A1 SPI slave transmit enable (direction controlled by USCI) */
#define PM_CBOUT1       17      /* INPUT: None, OUTPUT: Comparator_B output */
#define PM_MCLK         18      /* INPUT: None, OUTPUT: MCLK */

/* The value of the PM_ANALOG mnemonic is set to 0FFh. The port mapping registers
 * are only 5 bits wide and the upper bits are ignored resulting in a read out
 * value of 31. Using this mnemonic disables the output driver as well as the
 * input Schmitt-trigger to prevent parasitic cross currents when applying
 * analog signals.*/
#define PM_ANALOG       0xFF







/*#########################################################################
 *   Port Mapping Port 4
*##########################################################################*/

// Not supported yet




/*#########################################################################
 *   PMM  Power Management System
*##########################################################################*/


