dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
typedef volatile union
{
    uint16_t reg;   /* PMM control register 0 */
    struct
    {
        uint8_t reg_L;
        uint8_t reg_H;
    } bytes;
    struct
    {
        uint16_t PMMCOREVx        : 2; /* Core Voltage */
        uint16_t PMMSWBOR         : 1; /* Trigger software brownout reset */
        uint16_t PMMSWPOR         : 1; /* Trigger software power-on reset */
        uint16_t PMMREGOFF        : 1; /* Regulator off */
    } bits;
} PMMCTL0_t;

#define p_PMMCTL0               ((PMMCTL0_t              *) 0x0120u)
#define PMMCTL0                 p_PMMCTL0->reg
#define PMMCTL0_L               p_PMMCTL0->bytes.reg_L
#define PMMCTL0_H               p_PMMCTL0->bytes.reg_H
#define PMMCTL0_bits            p_PMMCTL0->bits


#define PMMPW               (0xA500u)  /* PMM Register Write Password - word */
#define PMMPW_word          (0xA500u)  /* PMM Register Write Password - word */
#define PMMPW_byte          (0xA5u)    /* PMM Register Write Password - byte */

#define PMMCOREV_0          (0x0000u)  /* PMM Core Voltage 0 (1.44V) */
#define PMMCOREV_1          (0x0001u)  /* PMM Core Voltage 1 (1.64V) */
#define PMMCOREV_2          (0x0002u)  /* PMM Core Voltage 2 (1.84V) */
#define PMMCOREV_3          (0x0003u)  /* PMM Core Voltage 3 (1.94V) */


typedef volatile union
{
    uint16_t reg;   /* PMM control register 1 */
    struct
    {
        uint8_t reg_L;
        uint8_t reg_H;
    } bytes;
} PMMCTL1_t;

#define p_PMMCTL1               ((PMMCTL1_t              *) 0x0122u)
#define PMMCTL1                 p_PMMCTL1->reg
#define PMMCTL1_L               p_PMMCTL1->bytes.reg_L
#define PMMCTL1_H               p_PMMCTL1->bytes.reg_H


typedef volatile union
{
    uint16_t reg;   /* SVS and SVM high side control register */
    struct
    {
        uint8_t reg_L;
        uint8_t reg_H;
    } bytes;
    struct
    {
        uint16_t SVSMHRRLx        : 3; /* SVS and SVM high side Reset Release Voltage Level Bits */
        uint16_t SVSMHDLYST       : 1; /* SVS and SVM high side delay status */
        uint16_t SVSHMD           : 1; /* SVS high side mode */
        uint16_t                  : 1;
        uint16_t SVSMHEVM         : 1; /* SVS and SVM high side event mask */
        uint16_t SVSMHACE         : 1; /* SVS and SVM high side auto control enable */
        uint16_t SVSHRVLx         : 2; /* SVS high side reset voltage level Bits */
        uint16_t SVSHE            : 1; /* SVS high side enable */
        uint16_t SVSHFP           : 1; /* SVS high side full performace mode */
        uint16_t SVMHOVPE         : 1; /* SVM high side over-voltage enable */
        uint16_t                  : 1;
        uint16_t SVMHE            : 1; /* SVM high side enable */
        uint16_t SVMHFP           : 1; /* SVM high side full performace mode */
    } bits;
} SVSMHCTL_t;

#define p_SVSMHCTL              ((SVSMHCTL_t            *) 0x0124u)
#define SVSMHCTL                p_SVSMHCTL->reg
#define SVSMHCTL_L              p_SVSMHCTL->bytes.reg_L
#define SVSMHCTL_H              p_SVSMHCTL->bytes.reg_H
#define SVSMHCTL_bits           p_SVSMHCTL->bits


typedef volatile union
{
    uint16_t reg;   /* SVS and SVM low side control register */
    struct
    {
        uint8_t reg_L;
        uint8_t reg_H;
    } bytes;
    struct
    {
        uint16_t SVSMLRRLx        : 3; /* SVS and SVM low side Reset Release Voltage Level Bits */
        uint16_t SVSMLDLYST       : 1; /* SVS and SVM low side delay status */
        uint16_t SVSLMD           : 1; /* SVS low side mode */
        uint16_t                  : 1;
        uint16_t SVSMLEVM         : 1; /* SVS and SVM low side event mask */
        uint16_t SVSMLACE         : 1; /* SVS and SVM low side auto control enable */
        uint16_t SVSLRVLx         : 2; /* SVS low side reset voltage level Bits */
        uint16_t SVSLE            : 1; /* SVS low side enable */
        uint16_t SVSLFP           : 1; /* SVS low side full performace mode */
        uint16_t SVMLOVPE         : 1; /* SVM low side over-voltage enable */
        uint16_t                  : 1;
        uint16_t SVMLE            : 1; /* SVM low side enable */
        uint16_t SVMLFP           : 1; /* SVM low side full performace mode */
    } bits;
} SVSMLCTL_t;

#define p_SVSMLCTL              ((SVSMLCTL_t            *) 0x0126u)
#define SVSMLCTL                p_SVSMLCTL->reg
#define SVSMLCTL_L              p_SVSMLCTL->bytes.reg_L
#define SVSMLCTL_H              p_SVSMLCTL->bytes.reg_H
#define SVSMLCTL_bits           p_SVSMLCTL->bits


typedef volatile union
{
    uint16_t reg;   /* SVSIN and SVSOUT control register */
    struct
    {
        uint8_t reg_L;
        uint8_t reg_H;
    } bytes;
    struct
    {
        uint16_t                  : 3;
        uint16_t SVMLOE           : 1; /* SVM low side output enable */
        uint16_t SVMLVLROE        : 1; /* SVM low side voltage level reached output enable */
        uint16_t SVMOUTPOL        : 1; /* SVMOUT pin polarity */
        uint16_t                  : 5;
        uint16_t SVMHOE           : 1; /* SVM high side output enable */
        uint16_t SVMHVLROE        : 1; /* SVM high side voltage level reached output enable */
    } bits;
} SVSMIO_t;

#define p_SVSMIO                ((SVSMIO_t              *) 0x0128u)
#define SVSMIO                  p_SVSMIO->reg
#define SVSMIO_L                p_SVSMIO->bytes.reg_L
#define SVSMIO_H                p_SVSMIO->bytes.reg_H
#define SVSMIO_bits             p_SVSMIO->bits


typedef volatile union
{
    uint16_t reg;   /* PMM Interrupt Flag */
    struct
    {
        uint8_t reg_L;
        uint8_t reg_H;
    } bytes;
    struct
    {
        uint16_t SVSMLDLYIFG      : 1; /* SVS and SVM low side Delay expired interrupt flag */
        uint16_t SVMLIFG          : 1; /* SVM low side interrupt flag */
        uint16_t SVMLVLRIFG       : 1; /* SVM low side Voltage Level Reached interrupt flag */
        uint16_t                  : 1;
        uint16_t SVSMHDLYIFG      : 1; /* SVS and SVM high side Delay expired interrupt flag */
        uint16_t SVMHIFG          : 1; /* SVM high side interrupt flag */
        uint16_t SVMHVLRIFG       : 1; /* SVM high side Voltage Level Reached interrupt flag */
        uint16_t                  : 1;
        uint16_t PMMBORIFG        : 1; /* PMM Software BOR interrupt flag */
        uint16_t PMMRSTIFG        : 1; /* PMM RESET pin interrupt flag */
        uint16_t PMMPORIFG        : 1; /* PMM Software POR interrupt flag */
        uint16_t                  : 1;
        uint16_t SVSHIFG          : 1; /* SVS low side interrupt flag */
        uint16_t SVSLIFG          : 1; /* SVS high side interrupt flag */
        uint16_t                  : 1;
        uint16_t PMMLPM5IFG       : 1; /* LPM5 indication Flag */
    } bits;
} PMMIFG_t;

#define p_PMMIFG                ((PMMIFG_t              *) 0x012Cu)
#define PMMIFG                  p_PMMIFG->reg
#define PMMIFG_L                p_PMMIFG->bytes.reg_L
#define PMMIFG_H                p_PMMIFG->bytes.reg_H
#define PMMIFG_bits             p_PMMIFG->bits


