dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
typedef volatile union
{
    uint16_t reg;   /* PMM and RESET Interrupt Enable */
    struct
    {
        uint8_t reg_L;
        uint8_t reg_H;
    } bytes;
    struct
    {
        uint16_t SVSMLDLYIE       : 1; /* SVS and SVM low side Delay expired interrupt enable */
        uint16_t SVMLIE           : 1; /* SVM low side interrupt enable */
        uint16_t SVMLVLRIE        : 1; /* SVM low side Voltage Level Reached interrupt enable */
        uint16_t                  : 1;
        uint16_t SVSMHDLYIE       : 1; /* SVS and SVM high side Delay expired interrupt enable */
        uint16_t SVMHIE           : 1; /* SVM high side interrupt enable */
        uint16_t SVMHVLRIE        : 1; /* SVM high side Voltage Level Reached interrupt enable */
        uint16_t                  : 1;
        uint16_t SVSLPE           : 1; /* SVS low side POR enable */
        uint16_t SVMLVLRPE        : 1; /* SVM low side Voltage Level reached POR enable */
        uint16_t                  : 2;
        uint16_t SVSHPE           : 1; /* SVS high side POR enable */
        uint16_t SVMHVLRPE        : 1; /* SVM high side Voltage Level reached POR enable */
    } bits;
} PMMRIE_t;

#define p_PMMRIE                ((PMMRIE_t              *) 0x012Eu)
#define PMMRIE                  p_PMMRIE->reg
#define PMMRIE_L                p_PMMRIE->bytes.reg_L
#define PMMRIE_H                p_PMMRIE->bytes.reg_H
#define PMMRIE_bits             p_PMMRIE->bits


typedef volatile union
{
    uint16_t reg;   /* PMM Power Mode 5 Control Register 0 */
    struct
    {
        uint16_t LOCKLPM5        : 1; /* Lock I/O pin configuration upon entry/exit to/from LPM5 */
    } bits;
} PM5CTL0_t;

#define p_PM5CTL0               ((PM5CTL0_t             *) 0x0130u)
#define PM5CTL0                 p_PM5CTL0->reg
#define PM5CTL0_bits            p_PM5CTL0->bits







/*#########################################################################
 *   RC  RAM Control Module
*##########################################################################*/

// Not supported yet



/*#########################################################################
 *   Shared Reference
*##########################################################################*/

// Not supported yet



/*#########################################################################
 *   RTC  Real Time Clock
*##########################################################################*/

// Not supported yet



/*#########################################################################
 *   SFR  Special Function Registers
 *#########################################################################*/


typedef volatile union
{
    uint16_t reg;   /* Interrupt Enable 1 */
    struct
    {
        uint16_t WDTIE            : 1; /* WDT Interrupt Enable */
        uint16_t OFIE             : 1; /* Osc Fault Enable */
        uint16_t                  : 1;
        uint16_t VMAIE            : 1; /* Vacant Memory Interrupt Enable */
        uint16_t NMIIE            : 1; /* NMI Interrupt Enable */
        uint16_t ACCVIE           : 1; /* Flash Access Violation Interrupt Enable */
        uint16_t JMBINIE          : 1; /* JTAG Mail Box input Interrupt Enable */
        uint16_t JMBOUTIE         : 1; /* JTAG Mail Box output Interrupt Enable */
    } bits;
} SFRIE1_t;

#define p_SFRIE1            ((SFRIE1_t       *) 0x0100u)
#define SFRIE1              p_SFRIE1->reg
#define SFRIE1_bits         p_SFRIE1->bits


typedef volatile union
{
    uint16_t reg;   /* Interrupt Flag 1 */
    struct
    {
        uint16_t WDTIFG           : 1; /* WDT Interrupt Flag */
        uint16_t OFIFG            : 1; /* Osc Fault Flag */
        uint16_t                  : 1;
        uint16_t VMAIFG           : 1; /* Vacant Memory Interrupt Flag */
        uint16_t NMIIFG           : 1; /* NMI Interrupt Flag */
        uint16_t                  : 1;
        uint16_t JMBINIFG         : 1; /* JTAG Mail Box input Interrupt Flag */
        uint16_t JMBOUTIFG        : 1; /* JTAG Mail Box output Interrupt Flag */
    } bits;
} SFRIFG1_t;

#define p_SFRIFG1           ((SFRIFG1_t       *) 0x0102u)
#define SFRIFG1             p_SFRIFG1->reg
#define SFRIFG1_bits        p_SFRIFG1->bits


typedef volatile union
{
    uint16_t reg;   /* RESET Pin Control Register */
    struct
    {
        uint16_t SYSNMI           : 1; /* NMI select */
        uint16_t SYSNMIIES        : 1; /* NMI edge select */
        uint16_t SYSRSTUP         : 1; /* RESET Pin pull down/up select */
        uint16_t SYSRSTRE         : 1; /* RESET Pin Resistor enable */
    } bits;
} SFRRPCR_t;

#define p_SFRRPCR           ((SFRRPCR_t       *) 0x0104u)
#define SFRRPCR             p_SFRRPCR->reg
#define SFRRPCR_bits        p_SFRRPCR->bits







/*#########################################################################
 *   SYS  System Module
 *#########################################################################*/

// Not supported yet



/*#########################################################################
 *   Timer0_A5
 *#########################################################################*/


typedef volatile union
{
    uint16_t reg;     /* Timer0_A5 Control */
    struct
    {
        uint16_t TAIFG            : 1; /* Timer A counter interrupt flag */
        uint16_t TAIE             : 1; /* Timer A counter interrupt enable */
        uint16_t TACLR            : 1; /* Timer A counter clear */
        uint16_t                  : 1;
        uint16_t MCx              : 2; /* Timer A mode control bits */
        uint16_t IDx              : 2; /* Timer A clock input divider bits */
        uint16_t TASSELx          : 2; /* Timer A clock source select bits */
    } bits;
} TA0CTL_t;

#define p_TA0CTL                ((TA0CTL_t              *) 0x0340u)
#define TA0CTL                  p_TA0CTL->reg
#define TA0CTL_bits             p_TA0CTL->bits


typedef volatile union
{
    uint16_t reg;   /* Timer0_A5 Capture/Compare Control 0 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t                  : 1;
        uint16_t SCCI             : 1; /* Latched capture signal (read) */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TA0CCTL0_t;

#define p_TA0CCTL0              ((TA0CCTL0_t            *) 0x0342u)
#define TA0CCTL0                p_TA0CCTL0->reg
#define TA0CCTL0_bits           p_TA0CCTL0->bits


