dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
typedef volatile union
{
    uint16_t reg;   /* Timer0_A5 Capture/Compare Control 1 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t                  : 1;
        uint16_t SCCI             : 1; /* Latched capture signal (read) */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TA0CCTL1_t;

#define p_TA0CCTL1              ((TA0CCTL1_t        *) 0x0344u)
#define TA0CCTL1                p_TA0CCTL1->reg
#define TA0CCTL1_bits           p_TA0CCTL1->bits


typedef volatile union
{
    uint16_t reg;   /* Timer0_A5 Capture/Compare Control 2 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t                  : 1;
        uint16_t SCCI             : 1; /* Latched capture signal (read) */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TA0CCTL2_t;

#define p_TA0CCTL2              ((TA0CCTL2_t        *) 0x0346u)
#define TA0CCTL2                p_TA0CCTL2->reg
#define TA0CCTL2_bits           p_TA0CCTL2->bits


typedef volatile union
{
    uint16_t reg;   /* Timer0_A5 Capture/Compare Control 3 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t                  : 1;
        uint16_t SCCI             : 1; /* Latched capture signal (read) */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TA0CCTL3_t;

#define p_TA0CCTL3              ((TA0CCTL3_t        *) 0x0348u)
#define TA0CCTL3                p_TA0CCTL3->reg
#define TA0CCTL3_bits           p_TA0CCTL3->bits


typedef volatile union
{
    uint16_t reg;   /* Timer0_A5 Capture/Compare Control 4 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t                  : 1;
        uint16_t SCCI             : 1; /* Latched capture signal (read) */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TA0CCTL4_t;

#define p_TA0CCTL4              ((TA0CCTL4_t        *) 0x034Au)
#define TA0CCTL4                p_TA0CCTL4->reg
#define TA0CCTL4_bits           p_TA0CCTL4->bits


  /* Timer0_A5 */
typedef volatile uint16_t TA0R_t;
#define p_TA0R                  ((TA0R_t        *) 0x0350u)
#define TA0R                    *p_TA0R

  /* Timer0_A5 Capture/Compare 0 */
typedef volatile uint16_t TA0CCR0_t;
#define p_TA0CCR0               ((TA0CCR0_t     *) 0x0352u)
#define TA0CCR0                 *p_TA0CCR0

  /* Timer0_A5 Capture/Compare 1 */
typedef volatile uint16_t TA0CCR1_t;
#define p_TA0CCR1               ((TA0CCR1_t     *) 0x0354u)
#define TA0CCR1                 *p_TA0CCR1

  /* Timer0_A5 Capture/Compare 2 */
typedef volatile uint16_t TA0CCR2_t;
#define p_TA0CCR2               ((TA0CCR2_t     *) 0x0356u)
#define TA0CCR2                 *p_TA0CCR2

  /* Timer0_A5 Capture/Compare 3 */
typedef volatile uint16_t TA0CCR3_t;
#define p_TA0CCR3               ((TA0CCR3_t     *) 0x0358u)
#define TA0CCR3                 *p_TA0CCR3

  /* Timer0_A5 Capture/Compare 4 */
typedef volatile uint16_t TA0CCR4_t;
#define p_TA0CCR4               ((TA0CCR4_t     *) 0x035Au)
#define TA0CCR4                 *p_TA0CCR4

  /* Timer0_A5 Interrupt Vector Word */
typedef volatile uint16_t TA0IV_t;
#define p_TA0IV                 ((TA0IV_t       *) 0x036Eu)
#define TA0IV                   *p_TA0IV


typedef volatile union
{
    uint16_t reg;   /* Timer0_A5 Expansion Register 0 */
    struct
    {
        uint16_t TAIDEXx          : 3; /* Timer A Input divider expansion Bits */
    } bits;
} TA0EX0_t;

#define p_TA0EX0              ((TA0EX0_t        *) 0x0360u)
#define TA0EX0                p_TA0EX0->reg
#define TA0EX0_bits           p_TA0EX0->bits







/*#########################################################################
 *   Timer1_A3
 *#########################################################################*/


