dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
typedef volatile union
{
    uint16_t reg;   /* Timer1_A3 Control */
    struct
    {
        uint16_t TAIFG            : 1; /* Timer A counter interrupt flag */
        uint16_t TAIE             : 1; /* Timer A counter interrupt enable */
        uint16_t TACLR            : 1; /* Timer A counter clear */
        uint16_t                  : 1;
        uint16_t MCx              : 2; /* Timer A mode control bits */
        uint16_t IDx              : 2; /* Timer A clock input divider bits */
        uint16_t TASSELx          : 2; /* Timer A clock source select bits */
   } bits;
} TA1CTL_t;

#define p_TA1CTL                ((TA1CTL_t          *) 0x0380u)
#define TA1CTL                  p_TA1CTL->reg
#define TA1CTL_bits             p_TA1CTL->bits


typedef volatile union
{
    uint16_t reg;   /* Timer1_A3 Capture/Compare Control 0 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t                  : 1;
        uint16_t SCCI             : 1; /* Latched capture signal (read) */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TA1CCTL0_t;

#define p_TA1CCTL0              ((TA1CCTL0_t        *) 0x0382u)
#define TA1CCTL0                p_TA1CCTL0->reg
#define TA1CCTL0_bits           p_TA1CCTL0->bits


typedef volatile union
{
    uint16_t reg;   /* Timer1_A3 Capture/Compare Control 1 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t                  : 1;
        uint16_t SCCI             : 1; /* Latched capture signal (read) */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TA1CCTL1_t;

#define p_TA1CCTL1              ((TA1CCTL1_t        *) 0x0384u)
#define TA1CCTL1                p_TA1CCTL1->reg
#define TA1CCTL1_bits           p_TA1CCTL1->bits


typedef volatile union
{
    uint16_t reg;   /* Timer1_A3 Capture/Compare Control 2 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t                  : 1;
        uint16_t SCCI             : 1; /* Latched capture signal (read) */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TA1CCTL2_t;

#define p_TA1CCTL2              ((TA1CCTL2_t        *) 0x0386u)
#define TA1CCTL2                p_TA1CCTL2->reg
#define TA1CCTL2_bits           p_TA1CCTL2->bits


  /* Timer1_A3 */
typedef volatile uint16_t TA1R_t;
#define p_TA1R                  ((TA1R_t        *) 0x0390u)
#define TA1R                    *p_TA1R

  /* Timer1_A3 Capture/Compare 0 */
typedef volatile uint16_t TA1CCR0_t;
#define p_TA1CCR0               ((TA1CCR0_t     *) 0x0392u)
#define TA1CCR0                 *p_TA1CCR0

  /* Timer1_A3 Capture/Compare 1 */
typedef volatile uint16_t TA1CCR1_t;
#define p_TA1CCR1               ((TA1CCR1_t     *) 0x0394u)
#define TA1CCR1                 *p_TA1CCR1

  /* Timer1_A3 Capture/Compare 2 */
typedef volatile uint16_t TA1CCR2_t;
#define p_TA1CCR2               ((TA1CCR2_t     *) 0x0396u)
#define TA1CCR2                 *p_TA1CCR2

  /* Timer1_A3 Interrupt Vector Word */
typedef volatile uint16_t TA1IV_t;
#define p_TA1IV                 ((TA1IV_t       *) 0x03AEu)
#define TA1IV                   *p_TA1IV

typedef volatile union
{
    uint16_t reg;   /* Timer1_A3 Expansion Register 0 */
    struct
    {
        uint16_t TAIDEXx          : 3; /* Timer A Input divider expansion Bits */
    } bits;
} TA1EX0_t;

#define p_TA1EX0                ((TA1EX0_t      *) 0x03A0u)
#define TA1EX0                  p_TA1EX0->reg
#define TA1EX0_bits             p_TA1EX0->bits







/*#########################################################################
 *   Timer2_A3
 *#########################################################################*/

typedef volatile union
{
    uint16_t reg;   /* Timer2_A3 Control */
    struct
    {
        uint16_t TAIFG            : 1; /* Timer A counter interrupt flag */
        uint16_t TAIE             : 1; /* Timer A counter interrupt enable */
        uint16_t TACLR            : 1; /* Timer A counter clear */
        uint16_t                  : 1;
        uint16_t MCx              : 2; /* Timer A mode control bits */
        uint16_t IDx              : 2; /* Timer A clock input divider bits */
        uint16_t TASSELx          : 2; /* Timer A clock source select bits */
    } bits;
} TA2CTL_t;

