dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
#define p_TA2CTL                ((TA2CTL_t          *) 0x0400u)
#define TA2CTL                  p_TA2CTL->reg
#define TA2CTL_bits             p_TA2CTL->bits


typedef volatile union
{
    uint16_t reg;   /* Timer2_A3 Capture/Compare Control 0 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t                  : 1;
        uint16_t SCCI             : 1; /* Latched capture signal (read) */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TA2CCTL0_t;

#define p_TA2CCTL0              ((TA2CCTL0_t        *) 0x0402u)
#define TA2CCTL0                p_TA2CCTL0->reg
#define TA2CCTL0_bits           p_TA2CCTL0->bits


typedef volatile union
{
    uint16_t reg;   /* Timer2_A3 Capture/Compare Control 1 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t                  : 1;
        uint16_t SCCI             : 1; /* Latched capture signal (read) */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TA2CCTL1_t;

#define p_TA2CCTL1              ((TA2CCTL1_t        *) 0x0404u)
#define TA2CCTL1                p_TA2CCTL1->reg
#define TA2CCTL1_bits           p_TA2CCTL1->bits


typedef volatile union
{
    uint16_t reg;   /* Timer2_A3 Capture/Compare Control 2 */
    struct
    {
        uint16_t CCIFG           : 1; /* Capture/compare interrupt flag */
        uint16_t COV             : 1; /* Capture/compare overflow flag */
        uint16_t OUT             : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI             : 1; /* Capture input signal (read) */
        uint16_t CCIE            : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx         : 3; /* Output mode bits */
        uint16_t CAP             : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t                : 1;
        uint16_t SCCI            : 1; /* Latched capture signal (read) */
        uint16_t SCS             : 1; /* Capture sychronize */
        uint16_t CCISx           : 2; /* Capture input select bits */
        uint16_t CMx             : 2; /* Capture mode bits */
    } bits;
} TA2CCTL2_t;

#define p_TA2CCTL2              ((TA2CCTL2_t        *) 0x0406u)
#define TA2CCTL2                p_TA2CCTL2->reg
#define TA2CCTL2_bits           p_TA2CCTL2->bits


  /* Timer2_A3 */
typedef volatile uint16_t TA2R_t;
#define p_TA2R                  ((TA2R_t        *) 0x0410u)
#define TA2R                    *p_TA2R

  /* Timer2_A3 Capture/Compare 0 */
typedef volatile uint16_t TA2CCR0_t;
#define p_TA2CCR0               ((TA2CCR0_t     *) 0x0412u)
#define TA2CCR0                 *p_TA2CCR0

  /* Timer2_A3 Capture/Compare 1 */
typedef volatile uint16_t TA2CCR1_t;
#define p_TA2CCR1               ((TA2CCR1_t     *) 0x0414u)
#define TA2CCR1                 *p_TA2CCR1

  /* Timer2_A3 Capture/Compare 2 */
typedef volatile uint16_t TA2CCR2_t;
#define p_TA2CCR2               ((TA2CCR2_t     *) 0x0416u)
#define TA2CCR2                 *p_TA2CCR2

  /* Timer2_A3 Interrupt Vector Word */
typedef volatile uint16_t TA2IV_t;
#define p_TA2IV                 ((TA2IV_t       *) 0x042Eu)
#define TA2IV                   *p_TA2IV


typedef volatile union
{
    uint16_t reg;   /* Timer2_A3 Expansion Register 0 */
    struct
    {
        uint16_t TAIDEXx         : 3; /* Timer A Input divider expansion Bits */
    } bits;
} TA2EX0_t;

#define p_TA2EX0                ((TA2EX0_t      *) 0x0420u)
#define TA2EX0                  p_TA2EX0->reg
#define TA2EX0_bits             p_TA2EX0->bits









/*#########################################################################
 *   Timer0_B7
*#########################################################################*/


typedef volatile union
{
    uint16_t reg;   /* Timer0_B7 Control */
    struct
    {
        uint16_t TBIFG            : 1; /* Timer0_B7 interrupt flag */
        uint16_t TBIE             : 1; /* Timer0_B7 interrupt enable */
        uint16_t TBCLR            : 1; /* Timer0_B7 counter clear */
        uint16_t                  : 1;
        uint16_t MCx              : 2; /* Timer A mode control bits */
        uint16_t IDx              : 2; /* Timer A clock input divider bits */
        uint16_t TBSSELx          : 2; /* Clock source bits */
        uint16_t                  : 1;
        uint16_t CNTLx            : 2; /* Counter lenght bits */
        uint16_t TBCLGRP0         : 1; /* Timer0_B7 Compare latch load group 0 */
        uint16_t TBCLGRP1         : 1; /* Timer0_B7 Compare latch load group 1 */
    } bits;
} TB0CTL_t;

#define p_TB0CTL                ((TB0CTL_t          *) 0x03C0u)
#define TB0CTL                  p_TB0CTL->reg
#define TB0CTL_bits             p_TB0CTL->bits


typedef volatile union
{
    uint16_t reg;   /* Timer0_B7 Capture/Compare Control 0 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t CLLDx            : 2; /* Compare latch load source bits */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TB0CCTL0_t;

#define p_TB0CCTL0              ((TB0CCTL0_t        *) 0x03C2u)
#define TB0CCTL0                p_TB0CCTL0->reg
#define TB0CCTL0_bits           p_TB0CCTL0->bits


