dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
typedef volatile union
{
    uint16_t reg;   /* Timer0_B7 Capture/Compare Control 1 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t CLLDx            : 2; /* Compare latch load source bits */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TB0CCTL1_t;

#define p_TB0CCTL1              ((TB0CCTL1_t        *) 0x03C4u)
#define TB0CCTL1                p_TB0CCTL1->reg
#define TB0CCTL1_bits           p_TB0CCTL1->bits


typedef volatile union
{
    uint16_t reg;   /* Timer0_B7 Capture/Compare Control 2 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t CLLDx            : 2; /* Compare latch load source bits */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TB0CCTL2_t;

#define p_TB0CCTL2              ((TB0CCTL2_t        *) 0x03C6u)
#define TB0CCTL2                p_TB0CCTL2->reg
#define TB0CCTL2_bits           p_TB0CCTL2->bits


typedef volatile union
{
    uint16_t reg;   /* Timer0_B7 Capture/Compare Control 3 */
    struct
    {
        uint16_t CCIFG           : 1; /* Capture/compare interrupt flag */
        uint16_t COV             : 1; /* Capture/compare overflow flag */
        uint16_t OUT             : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI             : 1; /* Capture input signal (read) */
        uint16_t CCIE            : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx         : 3; /* Output mode bits */
        uint16_t CAP             : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t CLLDx           : 1; /* Compare latch load source bits */
        uint16_t SCS             : 1; /* Capture sychronize */
        uint16_t CCISx           : 2; /* Capture input select bits */
        uint16_t CMx             : 2; /* Capture mode bits */
    } bits;
} TB0CCTL3_t;

#define p_TB0CCTL3              ((TB0CCTL3_t        *) 0x03C8u)
#define TB0CCTL3                p_TB0CCTL3->reg
#define TB0CCTL3_bits           p_TB0CCTL3->bits


typedef volatile union
{
    uint16_t reg;   /* Timer0_B7 Capture/Compare Control 4 */
    struct
    {
        uint16_t CCIFG           : 1; /* Capture/compare interrupt flag */
        uint16_t COV             : 1; /* Capture/compare overflow flag */
        uint16_t OUT             : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI             : 1; /* Capture input signal (read) */
        uint16_t CCIE            : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx         : 3; /* Output mode bits */
        uint16_t CAP             : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t CLLDx           : 2; /* Compare latch load source bits */
        uint16_t SCS             : 1; /* Capture sychronize */
        uint16_t CCISx           : 2; /* Capture input select bits */
        uint16_t CMx             : 2; /* Capture mode bits */
    } bits;
} TB0CCTL4_t;

#define p_TB0CCTL4              ((TB0CCTL4_t        *) 0x03CAu)
#define TB0CCTL4                p_TB0CCTL4->reg
#define TB0CCTL4_bits           p_TB0CCTL4->bits


typedef volatile union
{
    uint16_t reg;   /* Timer0_B7 Capture/Compare Control 5 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t CLLDx            : 2; /* Compare latch load source bits */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TB0CCTL5_t;

#define p_TB0CCTL5              ((TB0CCTL5_t        *) 0x03CCu)
#define TB0CCTL5                p_TB0CCTL5->reg
#define TB0CCTL5_bits           p_TB0CCTL5->bits


typedef volatile union
{
    uint16_t reg;   /* Timer0_B7 Capture/Compare Control 6 */
    struct
    {
        uint16_t CCIFG            : 1; /* Capture/compare interrupt flag */
        uint16_t COV              : 1; /* Capture/compare overflow flag */
        uint16_t OUT              : 1; /* PWM Output signal if output mode 0 */
        uint16_t CCI              : 1; /* Capture input signal (read) */
        uint16_t CCIE             : 1; /* Capture/compare interrupt enable */
        uint16_t OUTMODx          : 3; /* Output mode bits */
        uint16_t CAP              : 1; /* Capture mode: 1 /Compare mode : 0 */
        uint16_t CLLDx            : 2; /* Compare latch load source bits */
        uint16_t SCS              : 1; /* Capture sychronize */
        uint16_t CCISx            : 2; /* Capture input select bits */
        uint16_t CMx              : 2; /* Capture mode bits */
    } bits;
} TB0CCTL6_t;

#define p_TB0CCTL6              ((TB0CCTL6_t        *) 0x03CEu)
#define TB0CCTL6                p_TB0CCTL6->reg
#define TB0CCTL6_bits           p_TB0CCTL6->bits


  /* Timer0_B7 */
typedef volatile uint16_t TB0R_t;
#define p_TB0R                  ((TB0R_t        *) 0x03D0u)
#define TB0R                    *p_TB0R

  /* Timer0_B7 Capture/Compare 0 */
typedef volatile uint16_t TB0CCR0_t;
#define p_TB0CCR0               ((TB0CCR0_t     *) 0x03D2u)
#define TB0CCR0                 *p_TB0CCR0

  /* Timer0_B7 Capture/Compare 1 */
typedef volatile uint16_t TB0CCR1_t;
#define p_TB0CCR1               ((TB0CCR1_t     *) 0x03D4u)
#define TB0CCR1                 *p_TB0CCR1

