dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
  /* Timer0_B7 Capture/Compare 2 */
typedef volatile uint16_t TB0CCR2_t;
#define p_TB0CCR2               ((TB0CCR2_t     *) 0x03D6u)
#define TB0CCR2                 *p_TB0CCR2

  /* Timer0_B7 Capture/Compare 3 */
typedef volatile uint16_t TB0CCR3_t;
#define p_TB0CCR3               ((TB0CCR3_t     *) 0x03D8u)
#define TB0CCR3                 *p_TB0CCR3

  /* Timer0_B7 Capture/Compare 4 */
typedef volatile uint16_t TB0CCR4_t;
#define p_TB0CCR4               ((TB0CCR4_t     *) 0x03DAu)
#define TB0CCR4                 *p_TB0CCR4

  /* Timer0_B7 Capture/Compare 5 */
typedef volatile uint16_t TB0CCR5_t;
#define p_TB0CCR5               ((TB0CCR5_t     *) 0x03DCu)
#define TB0CCR5                 *p_TB0CCR5

  /* Timer0_B7 Capture/Compare 6 */
typedef volatile uint16_t TB0CCR6_t;
#define p_TB0CCR6               ((TB0CCR6_t     *) 0x03DEu)
#define TB0CCR6                 *p_TB0CCR6

/* Timer0_B7 Interrupt Vector Word */
typedef volatile uint16_t TB0IV_t;
#define p_TB0IV                 ((TB0IV_t       *) 0x03EEu)
#define TB0IV                   *p_TB0IV


typedef volatile union
{
    uint16_t reg;   /* Timer0_B7 Expansion Register 0 */
    struct
    {
        uint16_t TBIDEXx         : 3; /* Timer0_B7 Input divider expansion Bits */
    } bits;
} TB0EX0_t;

#define p_TB0EX0                ((TB0EX0_t      *) 0x03E0u)
#define TB0EX0                  p_TB0EX0->reg
#define TB0EX0_bits             p_TB0EX0->bits







/*#########################################################################
 *   USB Configuration Registers
 *#########################################################################*/

// Not supported yet



/*#########################################################################
 *   USB Control Registers
 *#########################################################################*/

// Not supported yet



/*#########################################################################
 *   UCS  Unified System Clock
 *#########################################################################*/


typedef volatile union
{
    uint16_t reg;     /* UCS Control Register 0 */
    struct
    {
        uint16_t              : 3;
        uint16_t MODx         : 5; /* Modulation Bit Counter Bits */
        uint16_t DCOx         : 5; /* DCO TAP Bits */
    } bits;
} UCSCTL0_t;

#define p_UCSCTL0           ((UCSCTL0_t         *) 0x0160u)
#define UCSCTL0             p_UCSCTL0->reg
#define UCSCTL0_bits        p_UCSCTL0->bits

enum {
    MOD0            = 0x0008,
    MOD1            = 0x0010,
    MOD2            = 0x0020,
    MOD3            = 0x0040,
    MOD4            = 0x0080,
    DCO0            = 0x0100,
    DCO1            = 0x0200,
    DCO2            = 0x0400,
    DCO3            = 0x0800,
    DCO4            = 0x1000
};


typedef volatile union
{
    uint16_t reg;     /* UCS Control Register 1 */
    struct
    {
        uint16_t DISMOD       : 1; /* Disable Modulation */
        uint16_t              : 3;
        uint16_t DCORSELx     : 3; /* DCO Freq. Range Select Bits */
    } bits;
} UCSCTL1_t;

#define p_UCSCTL1           ((UCSCTL1_t         *) 0x0162u)
#define UCSCTL1             p_UCSCTL1->reg
#define UCSCTL1_bits        p_UCSCTL1->bits

enum {
    DISMOD          = 0x0001,
    DCORSEL0        = 0x0010,
    DCORSEL1        = 0x0020,
    DCORSEL2        = 0x0040
};


typedef volatile union
{
    uint16_t reg;     /* UCS Control Register 2 */
    struct
    {
        uint16_t FLLNx        : 10; /* FLL Multipier Bits */
        uint16_t              : 2;
        uint16_t FLLDx        : 3; /* Loop Divider Bits */
    } bits;
} UCSCTL2_t;

#define p_UCSCTL2           ((UCSCTL2_t         *) 0x0164u)
#define UCSCTL2             p_UCSCTL2->reg
#define UCSCTL2_bits        p_UCSCTL2->bits

enum {
    FLLN0           = 0x0001,
    FLLN1           = 0x0002,
    FLLN2           = 0x0004,
    FLLN3           = 0x0008,
    FLLN4           = 0x0010,
    FLLN5           = 0x0020,
    FLLN6           = 0x0040,
    FLLN7           = 0x0080,
    FLLN8           = 0x0100,
    FLLN9           = 0x0200,
    FLLD0           = 0x1000,
    FLLD1           = 0x2000,
    FLLD2           = 0x4000
};


typedef volatile union
{
    uint16_t reg;     /* UCS Control Register 3 */
    struct
    {
        uint16_t FLLREFDIVx   : 3; /* Reference Divider Bits */
        uint16_t              : 1;
        uint16_t SELREFx      : 3; /* FLL Reference Clock Select Bits */
    } bits;
} UCSCTL3_t;

#define p_UCSCTL3           ((UCSCTL3_t         *) 0x0166u)
#define UCSCTL3             p_UCSCTL3->reg
#define UCSCTL3_bits        p_UCSCTL3->bits

enum {
    FLLREFDIV0      = 0x0001,
    FLLREFDIV1      = 0x0002,
    FLLREFDIV2      = 0x0004,
    SELREF0         = 0x0010,
    SELREF1         = 0x0020,
    SELREF2         = 0x0040
};


typedef volatile union
{
    uint16_t reg;     /* UCS Control Register 4 */
    struct
    {
        uint16_t SELMx        : 3; /* MCLK Source Select Bits */
        uint16_t              : 1;
        uint16_t SELSx        : 3; /* SMCLK Source Select Bits */
        uint16_t              : 1;
        uint16_t SELAx        : 3; /* ACLK Source Select Bits */
    } bits;
} UCSCTL4_t;

#define p_UCSCTL4           ((UCSCTL4_t         *) 0x0168u)
#define UCSCTL4             p_UCSCTL4->reg
#define UCSCTL4_bits        p_UCSCTL4->bits

enum {
    SELM0           = 0x0001,
    SELM1           = 0x0002,
    SELM2           = 0x0004,
    SELS0           = 0x0010,
    SELS1           = 0x0020,
    SELS2           = 0x0040,
    SELA0           = 0x0100,
    SELA1           = 0x0200,
    SELA2           = 0x0400
};


typedef volatile union
{
    uint16_t reg;     /* UCS Control Register 5 */
    struct
    {
        uint16_t DIVMx        : 3; /* MCLK Divider Bits */
        uint16_t              : 1;
        uint16_t DIVSx        : 3; /* SMCLK Divider Bits */
        uint16_t              : 1;
        uint16_t DIVAx        : 3; /* ACLK Divider Bits */
        uint16_t              : 1;
        uint16_t DIVPAx       : 3; /* ACLK from Pin Divider Bits */
    } bits;
} UCSCTL5_t;

