dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
#define p_UCSCTL5           ((UCSCTL5_t         *) 0x016Au)
#define UCSCTL5             p_UCSCTL5->reg
#define UCSCTL5_bits        p_UCSCTL5->bits

enum {
    DIVM0           = 0x0001,
    DIVM1           = 0x0002,
    DIVM2           = 0x0004,
    DIVS0           = 0x0010,
    DIVS1           = 0x0020,
    DIVS2           = 0x0040,
    DIVA0           = 0x0100,
    DIVA1           = 0x0200,
    DIVA2           = 0x0400,
    DIVPA0          = 0x1000,
    DIVPA1          = 0x2000,
    DIVPA2          = 0x4000
};


typedef volatile union
{
    uint16_t reg;     /* UCS Control Register 6 */
    struct
    {
        uint16_t XT1OFF       : 1; /* High Frequency Oscillator 1 (XT1) disable */
        uint16_t SMCLKOFF     : 1; /* SMCLK Off */
        uint16_t XCAPx        : 2; /* XIN/XOUT Cap Bits */
        uint16_t XT1BYPASS    : 1; /* XT1 bypass mode : 0: internal 1:sourced from external pin */
        uint16_t XTS          : 1; /* 1: Selects high-freq. oscillator */
        uint16_t XT1DRIVEx    : 2; /* XT1 Drive Level mode Bits */
        uint16_t XT2OFF       : 1; /* High Frequency Oscillator 2 (XT2) disable */
        uint16_t              : 3;
        uint16_t XT2BYPASS    : 1; /* XT2 bypass mode : 0: internal 1:sourced from external pin */
        uint16_t              : 1;
        uint16_t XT2DRIVEx    : 2; /* XT2 Drive Level mode Bits */
    } bits;
} UCSCTL6_t;

#define p_UCSCTL6           ((UCSCTL6_t         *) 0x016Cu)
#define UCSCTL6             p_UCSCTL6->reg
#define UCSCTL6_bits        p_UCSCTL6->bits

enum {
    XT1OFF          = 0x0001,
    SMCLKOFF        = 0x0002,
    XCAP0           = 0x0004,
    XCAP1           = 0x0008,
    XT1BYPASS       = 0x0010,
    XTS             = 0x0020,
    XT1DRIVE0       = 0x0040,
    XT1DRIVE1       = 0x0080,
    XT2OFF          = 0x0100,
    XT2BYPASS       = 0x1000,
    XT2DRIVE0       = 0x4000,
    XT2DRIVE1       = 0x8000
};


typedef volatile union
{
    uint16_t reg;     /* UCS Control Register 7 */
    struct
    {
        uint16_t DCOFFG       : 1; /* DCO Fault Flag */
        uint16_t XT1LFOFFG    : 1; /* XT1 Low Frequency Oscillator Fault Flag */
        uint16_t XT1HFOFFG    : 1; /* XT1 High Frequency Oscillator Fault Flag */
        uint16_t XT2OFFG      : 1; /* High Frequency Oscillator 2 Fault Flag */
    } bits;
} UCSCTL7_t;

#define p_UCSCTL7           ((UCSCTL7_t         *) 0x016Eu)
#define UCSCTL7             p_UCSCTL7->reg
#define UCSCTL7_bits        p_UCSCTL7->bits

enum {
    DCOFFG          = 0x0001,
    XT1LFOFFG       = 0x0002,
    XT1HFOFFG       = 0x0004,
    XT2OFFG         = 0x0008
};


typedef volatile union
{
    uint16_t reg;     /* UCS Control Register 8 */
    struct
    {
        uint16_t ACLKREQEN    : 1; /* ACLK Clock Request Enable */
        uint16_t MCLKREQEN    : 1; /* MCLK Clock Request Enable */
        uint16_t SMCLKREQEN   : 1; /* SMCLK Clock Request Enable */
        uint16_t MODOSCREQEN  : 1; /* MODOSC Clock Request Enable */
    } bits;
} UCSCTL8_t;

#define p_UCSCTL8           ((UCSCTL8_t         *) 0x0170u)
#define UCSCTL8             p_UCSCTL8->reg
#define UCSCTL8_bits        p_UCSCTL8->bits

enum {
    ACLKREQEN       = 0x0001,
    MCLKREQEN       = 0x0002,
    SMCLKREQEN      = 0x0004,
    MODOSCREQEN     = 0x0008
};







/*#########################################################################
 *   USCI_A0 & USCI_A1  UART and SPI Modes
 *#########################################################################*/


typedef volatile union
{
    uint8_t reg;     /* USCI control 1 */
    union
    {
        struct
        {
            uint8_t UCSWRST       : 1; /* USCI Software Reset */
            uint8_t UCTXBRK       : 1; /* Send next Data as Break */
            uint8_t UCTXADDR      : 1; /* Send next Data as Address */
            uint8_t UCDORM        : 1; /* Dormant (Sleep) Mode */
            uint8_t UCBRKIE       : 1; /* Break interrupt enable */
            uint8_t UCRXEIE       : 1; /* RX Error interrupt enable */
            uint8_t UCSSELx       : 2; /* USCI 0 Clock Source Select bits */
        };
        struct
        {
            uint8_t               : 1; /* UCSYNC */
            uint8_t               : 2; /* UCMODEx */
            uint8_t UCMST         : 1; /* Master mode select: 0:slave, 1:master */
            uint8_t               : 1; /* UC7BIT */
            uint8_t               : 1; /* UCMSB */
            uint8_t UCCKPL        : 1; /* Clock polarity select: 0:inactive low, 1:inactive high */
            uint8_t UCCKPH        : 1; /* Clock phase select: 0:data changed on UCLK edge
                                                                    1:data captured on UCLK edge. */
        };
    } bits;
} UCAxCTL1_t;

#define p_UCA0CTL1          ((UCAxCTL1_t         *) 0x05C0u)
#define UCA0CTL1            p_UCA0CTL1->reg
#define UCA0CTL1_bits       p_UCA0CTL1->bits

#define p_UCA1CTL1          ((UCAxCTL1_t         *) 0x0600u)
#define UCA1CTL1            p_UCA1CTL1->reg
#define UCA1CTL1_bits       p_UCA1CTL1->bits


typedef volatile union
{
    uint8_t reg;     /* USCI control 0 */
    union
    {
        struct
        {
            uint8_t UCSYNC        : 1; /* Sync-Mode  0:UART-Mode / 1:SPI-Mode */
            uint8_t UCMODEx       : 2; /* Async. Mode: USCI Mode Bits */
            uint8_t UCSPB         : 1; /* Async. Mode: Stop Bits  0:one / 1: two */
            uint8_t UC7BIT        : 1; /* Async. Mode: Data Bits  0:8-bits / 1:7-bits */
            uint8_t UCMSB         : 1; /* Async. Mode: MSB first  0:LSB / 1:MSB */
            uint8_t UCPAR         : 1; /* Async. Mode: Parity     0:odd / 1:even */
            uint8_t UCPEN         : 1; /* Async. Mode: Parity enable */
        };
        struct
        {
            uint8_t               : 1; /* UCSYNC */
            uint8_t               : 2; /* UCMODEx */
            uint8_t UCMST         : 1; /* Master mode select: 0:slave, 1:master */
            uint8_t               : 1; /* UC7BIT */
            uint8_t               : 1; /* UCMSB */
            uint8_t UCCKPL        : 1; /* Clock polarity select: 0:inactive low, 1:inactive high */
            uint8_t UCCKPH        : 1; /* Clock phase select: 0:data changed on UCLK edge
                                                                    1:data captured on UCLK edge. */
        };
    } bits;
} UCAxCTL0_t;

#define p_UCA0CTL0          ((UCAxCTL0_t         *) 0x05C1u)
#define UCA0CTL0            p_UCA0CTL0->reg
#define UCA0CTL0_bits       p_UCA0CTL0->bits

#define p_UCA1CTL0          ((UCAxCTL0_t         *) 0x0601u)
#define UCA1CTL0            p_UCA1CTL0->reg
#define UCA1CTL0_bits       p_UCA1CTL0->bits


