dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
/* USCI baud rate control word */
typedef volatile uint16_t UCAxBRW_t;
#define p_UCA0BRW               ((UCAxBRW_t     *) 0x05C6u)
#define UCA0BRW                 *p_UCA0BRW
#define p_UCA1BRW               ((UCAxBRW_t     *) 0x0606u)
#define UCA1BRW                 *p_UCA1BRW

/* USCI baud rate 0 */
typedef volatile uint8_t UCAxBR0_t;
#define p_UCA0BR0               ((UCAxBR0_t     *) 0x05C6u)
#define UCA0BR0                 *p_UCA0BR0
#define p_UCA1BR0               ((UCAxBR0_t     *) 0x0606u)
#define UCA1BR0                 *p_UCA1BR0

/* USCI baud rate 1 */
typedef volatile uint8_t UCAxBR1_t;
#define p_UCA0BR1               ((UCAxBR1_t     *) 0x05C7u)
#define UCA0BR1                 *p_UCA0BR1
#define p_UCA1BR1               ((UCAxBR1_t     *) 0x0607u)
#define UCA1BR1                 *p_UCA1BR1


typedef volatile union
{
    uint8_t reg;     /* USCI modulation control */
    struct
    {
        uint8_t UCOS16        : 1; /* USCI 16-times Oversampling enable */
        uint8_t UCBRSx        : 3; /* USCI Second Stage Modulation Select Bits */
        uint8_t UCBRFx        : 4; /* USCI First Stage Modulation Select Bits */
    } bits;
} UCAxMCTL_t;

#define p_UCA0MCTL          ((UCAxMCTL_t         *) 0x05C8u)
#define UCA0MCTL            p_UCA0MCTL->reg
#define UCA0MCTL_bits       p_UCA0MCTL->bits

#define p_UCA1MCTL          ((UCAxMCTL_t         *) 0x0608u)
#define UCA1MCTL            p_UCA1MCTL->reg
#define UCA1MCTL_bits       p_UCA1MCTL->bits


typedef volatile union
{
    uint8_t reg;     /* USCI status */
    struct
    {
        uint8_t UCBUSY        : 1; /* USCI Busy Flag */
        uint8_t UCADDR        : 1; /* USCI Address received Flag */
        uint8_t UCRXERR       : 1; /* USCI RX Error Flag */
        uint8_t UCBRK         : 1; /* USCI Break received */
        uint8_t UCPE          : 1; /* USCI Parity Error Flag */
        uint8_t UCOE          : 1; /* USCI Overrun Error Flag */
        uint8_t UCFE          : 1; /* USCI Frame Error Flag */
        uint8_t UCLISTEN      : 1; /* USCI Listen mode */
    } bits;
} UCAxSTAT_t;

#define p_UCA0STAT          ((UCAxSTAT_t         *) 0x05CAu)
#define UCA0STAT            p_UCA0STAT->reg
#define UCA0STAT_bits       p_UCA0STAT->bits

#define p_UCA1STAT          ((UCAxSTAT_t         *) 0x060Au)
#define UCA1STAT            p_UCA1STAT->reg
#define UCA1STAT_bits       p_UCA1STAT->bits


/* USCI receive buffer */
typedef volatile uint8_t UCAxRXBUF_t;
#define p_UCA0RXBUF             ((UCAxRXBUF_t     *) 0x05CCu)
#define UCA0RXBUF               *p_UCA0RXBUF
#define p_UCA1RXBUF             ((UCAxRXBUF_t     *) 0x060Cu)
#define UCA1RXBUF               *p_UCA1RXBUF


/* USCI transmit buffer */
typedef volatile uint8_t UCAxTXBUF_t;
#define p_UCA0TXBUF             ((UCAxTXBUF_t     *) 0x05CEu)
#define UCA0TXBUF               *p_UCA0TXBUF
#define p_UCA1TXBUF             ((UCAxTXBUF_t     *) 0x060Eu)
#define UCA1TXBUF               *p_UCA1TXBUF


typedef volatile union
{
    uint8_t reg;     /* USCI auto baud rate control */
    struct
    {
        uint8_t UCABDEN       : 1; /* Auto Baud Rate detect enable */
        uint8_t               : 1;
        uint8_t UCBTOE        : 1; /* Break Timeout error */
        uint8_t UCSTOE        : 1; /* Sync-Field Timeout error */
        uint8_t UCDELIMx      : 2; /* Break Sync Delimiter Bits */
    } bits;
} UCAxABCTL_t;

#define p_UCA0ABCTL         ((UCAxABCTL_t         *) 0x05D0u)
#define UCA0ABCTL           p_UCA0ABCTL->reg
#define UCA0ABCTL_bits      p_UCA0ABCTL->bits

#define p_UCA1ABCTL         ((UCAxABCTL_t         *) 0x0610u)
#define UCA1ABCTL           p_UCA1ABCTL->reg
#define UCA1ABCTL_bits      p_UCA1ABCTL->bits


typedef volatile union
{
    uint8_t reg;     /* USCI IrDA transmit control */
    struct
    {
        uint8_t UCIREN        : 1; /* IRDA Encoder/Decoder enable */
        uint8_t UCIRTXCLK     : 1; /* IRDA Transmit Pulse Clock Select */
        uint8_t UCIRTXPLx     : 6; /* IRDA Transmit Pulse Length Bits */
    } bits;
} UCAxIRTCTL_t;

#define p_UCA0IRTCTL        ((UCAxIRTCTL_t         *) 0x05D2u)
#define UCA0IRTCTL          p_UCA0IRTCTL->reg
#define UCA0IRTCTL_bits     p_UCA0IRTCTL->bits

#define p_UCA1IRTCTL        ((UCAxIRTCTL_t         *) 0x0612u)
#define UCA1IRTCTL          p_UCA1IRTCTL->reg
#define UCA1IRTCTL_bits     p_UCA1IRTCTL->bits


typedef volatile union
{
    uint8_t reg;     /* USCI IrDA receive control */
    struct
    {
        uint8_t UCIRRXFE      : 1; /* IRDA Receive Filter enable */
        uint8_t UCIRRXPL      : 1; /* IRDA Receive Input Polarity */
        uint8_t UCIRRXFLx     : 6; /* IRDA Receive Filter Length Bits */
    } bits;
} UCAxIRRCTL_t;

#define p_UCA0IRRCTL        ((UCAxIRRCTL_t         *) 0x05D3u)
#define UCA0IRRCTL          p_UCA0IRRCTL->reg
#define UCA0IRRCTL_bits     p_UCA0IRRCTL->bits

#define p_UCA1IRRCTL        ((UCAxIRRCTL_t         *) 0x0613u)
#define UCA1IRRCTL          p_UCA1IRRCTL->reg
#define UCA1IRRCTL_bits     p_UCA1IRRCTL->bits


typedef volatile union
{
    uint8_t reg;     /* USCI interrupt enable */
    struct
    {
        uint8_t UCRXIE        : 1; /* USCI Receive Interrupt Enable */
        uint8_t UCTXIE        : 1; /* USCI Transmit Interrupt Enable */
    } bits;
} UCAxIE_t;

#define p_UCA0IE            ((UCAxIE_t         *) 0x05DCu)
#define UCA0IE              p_UCA0IE->reg
#define UCA0IE_bits         p_UCA0IE->bits

#define p_UCA1IE            ((UCAxIE_t         *) 0x061Cu)
#define UCA1IE              p_UCA1IE->reg
#define UCA1IE_bits         p_UCA1IE->bits


typedef volatile union
{
    uint8_t reg;     /* USCI interrupt flags */
    struct
    {
        uint8_t UCRXIFG       : 1; /* USCI Receive Interrupt Flag */
        uint8_t UCTXIFG       : 1; /* USCI Transmit Interrupt Flag */
    } bits;
} UCAxIFG_t;

#define p_UCA0IFG           ((UCAxIFG_t         *) 0x05DDu)
#define UCA0IFG             p_UCA0IFG->reg
#define UCA0IFG_bits        p_UCA0IFG->bits

#define p_UCA1IFG           ((UCAxIFG_t         *) 0x061Du)
#define UCA1IFG             p_UCA1IFG->reg
#define UCA1IFG_bits        p_UCA1IFG->bits


