dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
/* USCI interrupt vector word */
typedef volatile uint16_t UCAxIV_t;
#define p_UCA0IV                ((UCAxIV_t     *) 0x05DEu)
#define UCA0IV                  *p_UCA0IV
#define p_UCA1IV                ((UCAxIV_t     *) 0x061Eu)
#define UCA1IV                  *p_UCA1IV







/*#########################################################################
 *   USCI_B0 & USCI_B1  I2C and SPI Modes
 *#########################################################################*/


typedef volatile union
{
    uint8_t reg;     /* USCI synchronous control 1 */
    struct
    {
        uint8_t UCSWRST       : 1; /* USCI Software Reset */
        uint8_t UCTXSTT       : 1; /* Transmit START */
        uint8_t UCTXSTP       : 1; /* Transmit STOP */
        uint8_t UCTXNACK      : 1; /* Transmit NACK */
        uint8_t UCTR          : 1; /* Transmit/Receive Select/Flag */
        uint8_t               : 1;
        uint8_t UCSSELx       : 2; /* USCI Clock Source Select Bits */
    } bits;
} UCBxCTL1_t;

#define p_UCB0CTL1          ((UCBxCTL1_t         *) 0x05E0u)
#define UCB0CTL1            p_UCB0CTL1->reg
#define UCB0CTL1_bits       p_UCB0CTL1->bits

#define p_UCB1CTL1          ((UCBxCTL1_t         *) 0x0620u)
#define UCB1CTL1            p_UCB1CTL1->reg
#define UCB1CTL1_bits       p_UCB1CTL1->bits


typedef volatile union
{
    uint8_t reg;     /* USCI synchronous control 0  */
    union
    {
        struct
        {
            uint8_t UCSYNC        : 1; /* Sync-Mode  0:UART-Mode / 1:SPI-Mode */
            uint8_t UCMODEx       : 2; /* Async. Mode: USCI Mode Bits */
            uint8_t UCMST         : 1; /* Sync. Mode: Master Select */
            uint8_t               : 1;
            uint8_t UCMM          : 1; /* Multi-Master Environment */
            uint8_t UCSLA10       : 1; /* 10-bit Slave Address Mode */
            uint8_t UCA10         : 1; /* 10-bit Address Mode */
        };
        struct
        {
            uint8_t               : 1; /* UCSYNC */
            uint8_t               : 2; /* UCMODEx */
            uint8_t               : 1; /* UCMST */
            uint8_t               : 1; /* UC7BIT */
            uint8_t               : 1; /* UCMSB */
            uint8_t UCCKPL        : 1; /* Clock polarity select: 0:inactive low, 1:inactive high */
            uint8_t UCCKPH        : 1; /* Clock phase select: 0:data changed on UCLK edge
                                                                    1:data captured on UCLK edge. */
        };
    } bits;
} UCBxCTL0_t;

#define p_UCB0CTL0          ((UCBxCTL0_t         *) 0x05E1u)
#define UCB0CTL0            p_UCB0CTL0->reg
#define UCB0CTL0_bits       p_UCB0CTL0->bits

#define p_UCB1CTL0          ((UCBxCTL0_t         *) 0x0621u)
#define UCB1CTL0            p_UCB1CTL0->reg
#define UCB1CTL0_bits       p_UCB1CTL0->bits


/* USCI synchronous bit rate control word */
typedef volatile uint16_t UCBxBRW_t;
#define p_UCB0BRW               ((UCBxBRW_t     *) 0x05E6u)
#define UCB0BRW                 *p_UCB0BRW
#define p_UCB1BRW               ((UCBxBRW_t     *) 0x05E6u)
#define UCB1BRW                 *p_UCB1BRW

/* USCI synchronous bit rate 0  */
typedef volatile uint8_t UCBxBR0_t;
#define p_UCB0BR0               ((UCBxBR0_t     *) 0x05E6u)
#define UCB0BR0                 *p_UCB0BR0
#define p_UCB1BR0               ((UCBxBR0_t     *) 0x0626u)
#define UCB1BR0                 *p_UCB1BR0

/* USCI synchronous bit rate 1  */
typedef volatile uint8_t UCBxBR1_t;
#define p_UCB0BR1               ((UCBxBR1_t     *) 0x05E7u)
#define UCB0BR1                 *p_UCB0BR1
#define p_UCB1BR1               ((UCBxBR1_t     *) 0x0627u)
#define UCB1BR1                 *p_UCB1BR1


typedef volatile union
{
    uint8_t reg;     /* USCI synchronous status  */
    union
    {
        struct
        {
            uint8_t               : 4;
            uint8_t UCBBUSY       : 1; /* Bus Busy Flag */
            uint8_t UCGC          : 1; /* General Call address received Flag */
            uint8_t UCSCLLOW      : 1; /* SCL low */
        };
        struct
        {
            uint8_t UCBUSY        : 1; /* USCI Busy Flag */
            uint8_t               : 4;
            uint8_t UCOE          : 1; /* USCI Overrun Error Flag */
            uint8_t UCFE          : 1; /* USCI Frame Error Flag */
            uint8_t UCLISTEN      : 1; /* USCI Listen mode */
        };
    } bits;
} UCBxSTAT_t;

#define p_UCB0STAT          ((UCBxSTAT_t         *) 0x05EAu)
#define UCB0STAT            p_UCB0STAT->reg
#define UCB0STAT_bits       p_UCB0STAT->bits

#define p_UCB1STAT          ((UCBxSTAT_t         *) 0x062Au)
#define UCB1STAT            p_UCB1STAT->reg
#define UCB1STAT_bits       p_UCB1STAT->bits


/* USCI synchronous receive buffer */
typedef volatile uint8_t UCBxRXBUF_t;
#define p_UCB0RXBUF             ((UCBxRXBUF_t     *) 0x05ECu)
#define UCB0RXBUF               *p_UCB0RXBUF
#define p_UCB1RXBUF             ((UCBxRXBUF_t     *) 0x062Cu)
#define UCB1RXBUF               *p_UCB1RXBUF


/* USCI synchronous transmit buffer */
typedef volatile uint8_t UCBxTXBUF_t;
#define p_UCB0TXBUF             ((UCBxTXBUF_t     *) 0x05EEu)
#define UCB0TXBUF               *p_UCB0TXBUF
#define p_UCB1TXBUF             ((UCBxTXBUF_t     *) 0x062Eu)
#define UCB1TXBUF               *p_UCB1TXBUF


typedef volatile union
{
    uint16_t reg;     /* USCI I2C own address */
    struct
    {
        uint16_t I2COAx       : 10; /* I2C Own Address Bits */
        uint16_t              : 5;
        uint16_t UCGCEN       : 1;  /* I2C General Call enable */
    } bits;
} UCBxI2COA_t;

#define p_UCB0I2COA         ((UCBxI2COA_t         *) 0x05F0u)
#define UCB0I2COA           p_UCB0I2COA->reg
#define UCB0I2COA_bits      p_UCB0I2COA->bits

#define p_UCB1I2COA         ((UCBxI2COA_t         *) 0x0630u)
#define UCB1I2COA           p_UCB1I2COA->reg
#define UCB1I2COA_bits      p_UCB1I2COA->bits


typedef volatile union
{
    uint16_t reg;     /* USCI I2C slave address */
    struct
    {
        uint16_t I2CSAx       : 10; /* I2C Own Address Bits */
    } bits;
} UCBxI2CSA_t;

#define p_UCB0I2CSA         ((UCBxI2CSA_t         *) 0x05F2u)
#define UCB0I2CSA           p_UCB0I2CSA->reg
#define UCB0I2CSA_bits      p_UCB0I2CSA->bits

