dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP.h
#define p_UCB1I2CSA         ((UCBxI2CSA_t         *) 0x0632u)
#define UCB1I2CSA           p_UCB1I2CSA->reg
#define UCB1I2CSA_bits      p_UCB1I2CSA->bits


typedef volatile union
{
    uint8_t reg;     /* USCI interrupt enable */
    struct
    {
        uint8_t UCRXIE        : 1; /* I2C/SPI Receive Interrupt Enable */
        uint8_t UCTXIE        : 1; /* I2C/SPI Transmit Interrupt Enable */
        uint8_t UCSTTIE       : 1; /* START Condition interrupt enable */
        uint8_t UCSTPIE       : 1; /* STOP Condition interrupt enable */
        uint8_t UCALIE        : 1; /* Arbitration Lost interrupt enable */
        uint8_t UCNACKIE      : 1; /* NACK Condition interrupt enable */
    } bits;
} UCBxIE_t;

#define p_UCB0IE            ((UCBxIE_t         *) 0x05FCu)
#define UCB0IE              p_UCB0IE->reg
#define UCB0IE_bits         p_UCB0IE->bits

#define p_UCB1IE            ((UCBxIE_t         *) 0x063Cu)
#define UCB1IE              p_UCB1IE->reg
#define UCB1IE_bits         p_UCB1IE->bits


typedef volatile union
{
    uint8_t reg;     /* USCI interrupt flags */
    struct
    {
        uint8_t UCRXIFG       : 1; /* I2C/SPI Receive Interrupt Flag */
        uint8_t UCTXIFG       : 1; /* I2C/SPI Transmit Interrupt Flag */
        uint8_t UCSTTIFG      : 1; /* START Condition interrupt Flag */
        uint8_t UCSTPIFG      : 1; /* STOP Condition interrupt Flag */
        uint8_t UCALIFG       : 1; /* Arbitration Lost interrupt Flag */
        uint8_t UCNACKIFG     : 1; /* NACK Condition interrupt Flag */
    } bits;
} UCBxIFG_t;

#define p_UCB0IFG           ((UCBxIFG_t         *) 0x05FDu)
#define UCB0IFG             p_UCB0IFG->reg
#define UCB0IFG_bits        p_UCB0IFG->bits

#define p_UCB1IFG           ((UCBxIFG_t         *) 0x063Du)
#define UCB1IFG             p_UCB1IFG->reg
#define UCB1IFG_bits        p_UCB1IFG->bits


/* USCI interrupt vector word */
typedef volatile uint16_t UCBxIV_t;
#define p_UCB0IV                ((UCBxIV_t     *) 0x05FEu)
#define UCB0IV                  *p_UCB0IV
#define p_UCB1IV                ((UCBxIV_t     *) 0x063Eu)
#define UCB1IV                  *p_UCB1IV

#define UCBxIV_NO_INTERRUPT      0x00  /* No interrupt pending */
#define UCBxIV_SPI_UCRXIFG       0x02  /* SPI data received */
#define UCBxIV_SPI_UCTXIFG       0x04  /* SPI transmit buffer empty */
#define UCBxIV_I2C_ARBLOSS       0x02  /* I2C Arbitration Lost */
#define UCBxIV_I2C_NACK          0x04  /* I2C not acknowledge */
#define UCBxIV_I2C_START         0x06  /* I2C start condition received */
#define UCBxIV_I2C_STOP          0x08  /* I2C stop condition received */
#define UCBxIV_I2C_UCRXIFG       0x0A  /* I2C data received */
#define UCBxIV_I2C_UCTXIFG       0x0C  /* I2C transmit buffer empty */







/*#########################################################################
 *   Watchdog Timer
*##########################################################################*/


typedef volatile uint16_t WDTCTL_t;   /* Watchdog Timer Control */
#define p_WDTCTL                ((WDTCTL_t              *) 0x015Cu)
#define WDTCTL                  *p_WDTCTL

#define WDTPW               (0x5A00u)

/* The bit names have been prefixed with "WDT" */
/* WDTCTL Control Bits */
#define WDTIS0              (0x0001u)  /* WDT - Timer Interval Select 0 */
#define WDTIS1              (0x0002u)  /* WDT - Timer Interval Select 1 */
#define WDTIS2              (0x0004u)  /* WDT - Timer Interval Select 2 */
#define WDTCNTCL            (0x0008u)  /* WDT - Timer Clear */
#define WDTTMSEL            (0x0010u)  /* WDT - Timer Mode Select */
#define WDTSSEL0            (0x0020u)  /* WDT - Timer Clock Source Select 0 */
#define WDTSSEL1            (0x0040u)  /* WDT - Timer Clock Source Select 1 */
#define WDTHOLD             (0x0080u)  /* WDT - Timer hold */









/************************************************************
* TLV Descriptors
************************************************************/

#define __MSP430_HAS_TLV__              /* Definition to show that Module is available */
#define TLV_BASE __MSP430_BASEADDRESS_TLV__

#define TLV_CRC_LENGTH        (0x1A01)    /* CRC length of the TLV structure */
#define TLV_CRC_VALUE         (0x1A02)    /* CRC value of the TLV structure */
#define TLV_START             (0x1A08)    /* Start Address of the TLV structure */
#define TLV_END               (0x1AFF)    /* End Address of the TLV structure */

#define TLV_LDTAG             (0x01)      /*  Legacy descriptor (1xx, 2xx, 4xx families) */
#define TLV_PDTAG             (0x02)      /*  Peripheral discovery descriptor */
#define TLV_Reserved3         (0x03)      /*  Future usage */
#define TLV_Reserved4         (0x04)      /*  Future usage */
#define TLV_BLANK             (0x05)      /*  Blank descriptor */
#define TLV_Reserved6         (0x06)      /*  Future usage */
#define TLV_Reserved7         (0x07)      /*  Serial Number */
#define TLV_DIERECORD         (0x08)      /*  Die Record  */
#define TLV_ADCCAL            (0x11)      /*  ADC12 calibration */
#define TLV_ADC12CAL          (0x11)      /*  ADC12 calibration */
#define TLV_ADC10CAL          (0x13)      /*  ADC10 calibration */
#define TLV_REFCAL            (0x12)      /*  REF calibration */
#define TLV_TAGEXT            (0xFE)      /*  Tag extender */
#define TLV_TAGEND            (0xFF)      //  Tag End of Table


/************************************************************
* Timer A interrupt vector value
************************************************************/

/* Compability definitions */

#define TAIV_CCIFG1         TAIV_TACCR1       /* Capture/compare 1 */
#define TAIV_CCIFG2         TAIV_TACCR2       /* Capture/compare 2 */
#define TAIV_CCIFG3         TAIV_6            /* Capture/compare 3 */
#define TAIV_CCIFG4         TAIV_8            /* Capture/compare 4 */


/************************************************************
* Interrupt Vectors (offset from 0xFF80)
************************************************************/


#define RTC_VECTOR              (42)                     /* 0xFFD2 RTC */
#define PORT2_VECTOR            (43)                     /* 0xFFD4 Port 2 */
#define TIMER2_A1_VECTOR        (44)                     /* 0xFFD6 Timer2_A5 CC1-4, TA */
#define TIMER2_A0_VECTOR        (45)                     /* 0xFFD8 Timer2_A5 CC0 */
#define USCI_B1_VECTOR          (46)                     /* 0xFFDA USCI B1 Receive/Transmit */
#define USCI_A1_VECTOR          (47)                     /* 0xFFDC USCI A1 Receive/Transmit */
#define PORT1_VECTOR            (48)                     /* 0xFFDE Port 1 */
#define TIMER1_A1_VECTOR        (49)                     /* 0xFFE0 Timer1_A3 CC1-2, TA1 */
#define TIMER1_A0_VECTOR        (50)                     /* 0xFFE2 Timer1_A3 CC0 */
#define DMA_VECTOR              (51)                     /* 0xFFE4 DMA */
#define USB_UBM_VECTOR          (52)                     /* 0xFFE6 USB Timer / cable event / USB reset */
#define TIMER0_A1_VECTOR        (53)                     /* 0xFFE8 Timer0_A5 CC1-4, TA */
#define TIMER0_A0_VECTOR        (54)                     /* 0xFFEA Timer0_A5 CC0 */
#define ADC12_VECTOR            (55)                     /* 0xFFEC ADC */
#define USCI_B0_VECTOR          (56)                     /* 0xFFEE USCI B0 Receive/Transmit */
#define USCI_A0_VECTOR          (57)                     /* 0xFFF0 USCI A0 Receive/Transmit */
#define WDT_VECTOR              (58)                     /* 0xFFF2 Watchdog Timer */
#define TIMER0_B1_VECTOR        (59)                     /* 0xFFF4 Timer0_B7 CC1-6, TB */
#define TIMER0_B0_VECTOR        (60)                     /* 0xFFF6 Timer0_B7 CC0 */
#define COMP_B_VECTOR           (61)                     /* 0xFFF8 Comparator B */
#define UNMI_VECTOR             (62)                     /* 0xFFFA User Non-maskable */
#define SYSNMI_VECTOR           (63)                     /* 0xFFFC System Non-maskable */
#define RESET_VECTOR            ("reset")                /* 0xFFFE Reset [Highest Priority] */

/************************************************************
* End of Modules
************************************************************/
#ifdef __cplusplus
}
#endif /* extern "C" */


#endif /* #ifndef __MSP430F5529LP */

